[Killed] ConditionalExpression
robot/components/flow/FlowControlPanel.tsx:527:9
     // Issue #186: status bar uses the contained legacy status-panel Pro tone.
     // The selector card keeps its larger outer glow; this compact chip cannot,
     // or S8 shows purple bleeding outside the pill edges.
-    if (variant === "pro")
+    if (true)
       return "border-fuchsia-400/22 bg-fuchsia-500/10 text-fuchsia-100 shadow-[inset_0_1px_0_rgba(255,255,255,0.05)]";
     return "border-cyan-300/16 bg-[linear-gradient(180deg,rgba(34,211,238,0.08),rgba(12,20,27,0.84))] text-cyan-50/92 shadow-[inset_0_1px_0_rgba(255,255,255,0.04)]";
killedBy: FlowControlPanel — status metric labels per stage renders aiLabel column as 'BASIC' for free plan
statusReason: expected 'inline-flex h-8 min-w-0 items-center …' to contain 'border-cyan-300/16'

[Killed] ConditionalExpression
robot/components/flow/FlowControlPanel.tsx:527:9
     // Issue #186: status bar uses the contained legacy status-panel Pro tone.
     // The selector card keeps its larger outer glow; this compact chip cannot,
     // or S8 shows purple bleeding outside the pill edges.
-    if (variant === "pro")
+    if (false)
       return "border-fuchsia-400/22 bg-fuchsia-500/10 text-fuchsia-100 shadow-[inset_0_1px_0_rgba(255,255,255,0.05)]";
     return "border-cyan-300/16 bg-[linear-gradient(180deg,rgba(34,211,238,0.08),rgba(12,20,27,0.84))] text-cyan-50/92 shadow-[inset_0_1px_0_rgba(255,255,255,0.04)]";
killedBy: FlowControlPanel — status metric labels per stage uses contained legacy Pro tone without outer purple bleed
statusReason: expected 'inline-flex h-8 min-w-0 items-center …' to contain 'border-fuchsia-400/22'
