[Killed] ConditionalExpression
src/components/trade/TradeCardMiniChart.tsx:189:9
       }
       data-last-candle-time={lastDataTime == null ? "" : String(lastDataTime)}
       data-last-candle-close={
-        lastDataClose == null ? "" : String(lastDataClose)
+        true ? "" : String(lastDataClose)
       }
       data-max-candles={maxCandles}
killedBy: TradeCardMiniChart candle window keeps the legacy active-card window at 30 rendered and 15 visible candles
statusReason: expect(element).toHaveAttribute("data-last-candle-close", "64308") // element.getAttribute("data-last-candle-close") === "64308"

Expected the element to have attribute:
  data-last-candle-close="64308"
Received:
  data-last-candle-close=""

[Killed] ConditionalExpression
src/components/trade/TradeCardMiniChart.tsx:189:9
       }
       data-last-candle-time={lastDataTime == null ? "" : String(lastDataTime)}
       data-last-candle-close={
-        lastDataClose == null ? "" : String(lastDataClose)
+        false ? "" : String(lastDataClose)
       }
       data-max-candles={maxCandles}
killedBy: TradeCardMiniChart candle window reports an empty last close while the candle buffer is empty
statusReason: expect(element).toHaveAttribute("data-last-candle-close", "") // element.getAttribute("data-last-candle-close") === ""

Expected the element to have attribute:
  data-last-candle-close=""
Received:
  data-last-candle-close="undefined"
