[Killed] ConditionalExpression
robot/components/flow/AiModeStatusDropdown.tsx:143:9
         "w-full whitespace-nowrap text-[7px] font-semibold uppercase leading-[1.05] tracking-[0.03em] sm:text-[8px]",
         // Issue #186: the selector card keeps the larger Pro glow; this
         // compact status chip must use inset-only light or S8 shows bleed.
-        props.current === "pro"
+        true
           ? "border-fuchsia-400/22 bg-fuchsia-500/10 text-fuchsia-100 shadow-[inset_0_1px_0_rgba(255,255,255,0.05)] hover:border-fuchsia-300/35 hover:bg-fuchsia-500/12"
killedBy: AiModeStatusDropdown (R250) renders current mode as BASIC pill by default
statusReason: expected 'inline-flex h-8 w-full max-w-full min…' to contain 'cyan'

[Killed] EqualityOperator
robot/components/flow/AiModeStatusDropdown.tsx:143:9
         "w-full whitespace-nowrap text-[7px] font-semibold uppercase leading-[1.05] tracking-[0.03em] sm:text-[8px]",
         // Issue #186: the selector card keeps the larger Pro glow; this
         // compact status chip must use inset-only light or S8 shows bleed.
-        props.current === "pro"
+        props.current !== "pro"
           ? "border-fuchsia-400/22 bg-fuchsia-500/10 text-fuchsia-100 shadow-[inset_0_1px_0_rgba(255,255,255,0.05)] hover:border-fuchsia-300/35 hover:bg-fuchsia-500/12"
killedBy: AiModeStatusDropdown (R250) renders current mode as BASIC pill by default
statusReason: expected 'inline-flex h-8 w-full max-w-full min…' to contain 'cyan'

[Killed] StringLiteral
robot/components/flow/AiModeStatusDropdown.tsx:144:13
         // Issue #186: the selector card keeps the larger Pro glow; this
         // compact status chip must use inset-only light or S8 shows bleed.
         props.current === "pro"
-          ? "border-fuchsia-400/22 bg-fuchsia-500/10 text-fuchsia-100 shadow-[inset_0_1px_0_rgba(255,255,255,0.05)] hover:border-fuchsia-300/35 hover:bg-fuchsia-500/12"
+          ? ""
         "focus-visible:outline-none focus-visible:ring-2 focus-visible:ring-fuchsia-300/55",
killedBy: AiModeStatusDropdown (R250) renders PRO with contained legacy fuchsia tone (issue #186)
statusReason: expected 'inline-flex h-8 w-full max-w-full min…' to contain 'border-fuchsia-400/22'
