[Killed] LogicalOperator
src/features/trade/live-candles.ts:133:7
     return { kind: "replace", candles: [] };
   }
   if (hasLiveTickFoldedIntoTail(current, nextSeed)) return { kind: "keep" };
-  if (current.length > 0 && nextSeed.length < current.length) {
+  if (current.length > 0 || nextSeed.length < current.length) {
     return { kind: "keep" };
   }
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected 'keep' to be 'replace' // Object.is equality

[Killed] EqualityOperator
src/features/trade/live-candles.ts:133:29
     return { kind: "replace", candles: [] };
   }
   if (hasLiveTickFoldedIntoTail(current, nextSeed)) return { kind: "keep" };
-  if (current.length > 0 && nextSeed.length < current.length) {
+  if (current.length > 0 && nextSeed.length >= current.length) {
     return { kind: "keep" };
   }
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected 'keep' to be 'replace' // Object.is equality

[Killed] EqualityOperator
src/features/trade/live-candles.ts:136:7
   if (current.length > 0 && nextSeed.length < current.length) {
     return { kind: "keep" };
   }
-  if (current.length > 0) {
+  if (current.length <= 0) {
     const merged = mergeSeedWithLiveTail(current, nextSeed, maxCandles);
     if (merged !== null) return { kind: "replace", candles: merged };
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:136:7
   if (current.length > 0 && nextSeed.length < current.length) {
     return { kind: "keep" };
   }
-  if (current.length > 0) {
+  if (false) {
     const merged = mergeSeedWithLiveTail(current, nextSeed, maxCandles);
     if (merged !== null) return { kind: "replace", candles: merged };
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:138:9
   }
   if (current.length > 0) {
     const merged = mergeSeedWithLiveTail(current, nextSeed, maxCandles);
-    if (merged !== null) return { kind: "replace", candles: merged };
+    if (false) return { kind: "replace", candles: merged };
   }
   return { kind: "replace", candles: nextSeed };
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] EqualityOperator
src/features/trade/live-candles.ts:138:9
   }
   if (current.length > 0) {
     const merged = mergeSeedWithLiveTail(current, nextSeed, maxCandles);
-    if (merged !== null) return { kind: "replace", candles: merged };
+    if (merged === null) return { kind: "replace", candles: merged };
   }
   return { kind: "replace", candles: nextSeed };
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] EqualityOperator
src/features/trade/live-candles.ts:151:15
 ): ChartCandle[] {
   const bucketTime = bucketLiveTickTime(tick.time, intervalSeconds);
   const last = prev[prev.length - 1];
-  if (last && bucketTime < last.time) {
+  if (last && bucketTime >= last.time) {
     if (shouldPatchSyntheticTail(prev, intervalSeconds))
       return replaceLastLiveCandle(prev, last, tick.close);
killedBy: live candle helpers updates the active candle and keeps the broker history cap
statusReason: expected { time: 1700000160, open: 101.8, …(4) } to match object { close: 104, high: 104, low: 101.5 }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:151:15
 ): ChartCandle[] {
   const bucketTime = bucketLiveTickTime(tick.time, intervalSeconds);
   const last = prev[prev.length - 1];
-  if (last && bucketTime < last.time) {
+  if (last && true) {
     if (shouldPatchSyntheticTail(prev, intervalSeconds))
       return replaceLastLiveCandle(prev, last, tick.close);
killedBy: live candle helpers updates the active candle and keeps the broker history cap
statusReason: expected { time: 1700000160, open: 101.8, …(4) } to match object { close: 104, high: 104, low: 101.5 }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:152:9
   const bucketTime = bucketLiveTickTime(tick.time, intervalSeconds);
   const last = prev[prev.length - 1];
   if (last && bucketTime < last.time) {
-    if (shouldPatchSyntheticTail(prev, intervalSeconds))
+    if (true)
       return replaceLastLiveCandle(prev, last, tick.close);
     return [...prev];
killedBy: live candle helpers ignores out-of-order streaming ticks instead of appending stale candles
statusReason: expected 199 to be 102 // Object.is equality

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:152:9
   const bucketTime = bucketLiveTickTime(tick.time, intervalSeconds);
   const last = prev[prev.length - 1];
   if (last && bucketTime < last.time) {
-    if (shouldPatchSyntheticTail(prev, intervalSeconds))
+    if (false)
       return replaceLastLiveCandle(prev, last, tick.close);
     return [...prev];
killedBy: live candle helpers patches a synthetic current tail with the first delayed broker tick
statusReason: expected { time: 1700000520, open: 101, …(4) } to match object { close: 188, high: 188 }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:320:9
   for (const candle of nextSeed) byTime.set(candle.time, { ...candle });
   let changed = false;
   for (const candle of current) {
-    if (candle.time < nextLast.time) continue;
+    if (true) continue;
     const existing = byTime.get(candle.time);
     if (existing && sameLiveCandle(existing, candle)) continue;
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] EqualityOperator
src/features/trade/live-candles.ts:320:9
   for (const candle of nextSeed) byTime.set(candle.time, { ...candle });
   let changed = false;
   for (const candle of current) {
-    if (candle.time < nextLast.time) continue;
+    if (candle.time >= nextLast.time) continue;
     const existing = byTime.get(candle.time);
     if (existing && sameLiveCandle(existing, candle)) continue;
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] LogicalOperator
src/features/trade/live-candles.ts:322:9
   for (const candle of current) {
     if (candle.time < nextLast.time) continue;
     const existing = byTime.get(candle.time);
-    if (existing && sameLiveCandle(existing, candle)) continue;
+    if (existing || sameLiveCandle(existing, candle)) continue;
     byTime.set(candle.time, { ...candle });
     changed = true;
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: Cannot read properties of undefined (reading 'time')

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:322:9
   for (const candle of current) {
     if (candle.time < nextLast.time) continue;
     const existing = byTime.get(candle.time);
-    if (existing && sameLiveCandle(existing, candle)) continue;
+    if (true) continue;
     byTime.set(candle.time, { ...candle });
     changed = true;
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] ObjectLiteral
src/features/trade/live-candles.ts:323:29
     if (candle.time < nextLast.time) continue;
     const existing = byTime.get(candle.time);
     if (existing && sameLiveCandle(existing, candle)) continue;
-    byTime.set(candle.time, { ...candle });
+    byTime.set(candle.time, {});
     changed = true;
   }
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected {} to match object { time: 1700001840, close: 140 }

[Killed] BooleanLiteral
src/features/trade/live-candles.ts:324:15
     const existing = byTime.get(candle.time);
     if (existing && sameLiveCandle(existing, candle)) continue;
     byTime.set(candle.time, { ...candle });
-    changed = true;
+    changed = false;
   }
   if (!changed) return null;
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:326:7
     byTime.set(candle.time, { ...candle });
     changed = true;
   }
-  if (!changed) return null;
+  if (true) return null;
   return capLiveCandles(
     [...byTime.values()].sort((a, b) => a.time - b.time),
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] BooleanLiteral
src/features/trade/live-candles.ts:326:7
     byTime.set(candle.time, { ...candle });
     changed = true;
   }
-  if (!changed) return null;
+  if (changed) return null;
   return capLiveCandles(
     [...byTime.values()].sort((a, b) => a.time - b.time),
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/features/trade/live-candles.ts:328:41
   }
   if (!changed) return null;
   return capLiveCandles(
-    [...byTime.values()].sort((a, b) => a.time - b.time),
+    [...byTime.values()].sort((a, b) => a.time + b.time),
     maxCandles,
   );
killedBy: live candle helpers keeps current tail candles at the seed boundary and sorts newer tail
statusReason: expected 1700001900 to be 1700001840 // Object.is equality

[Killed] ArrowFunction
src/features/trade/live-candles.ts:328:31
   }
   if (!changed) return null;
   return capLiveCandles(
-    [...byTime.values()].sort((a, b) => a.time - b.time),
+    [...byTime.values()].sort(() => undefined),
     maxCandles,
   );
killedBy: live candle helpers keeps current tail candles at the seed boundary and sorts newer tail
statusReason: expected 1700001900 to be 1700001840 // Object.is equality

[Killed] MethodExpression
src/features/trade/live-candles.ts:362:20
   if (!last || !previous) return false;
   // The bucket-current synthetic tail may be far ahead of a stale Matrix seed;
   // the first broker tick should mutate that tail instead of being discarded.
-  const interval = Math.max(1, Math.floor(intervalSeconds));
+  const interval = Math.min(1, Math.floor(intervalSeconds));
   return last.time - previous.time > interval;
 }
killedBy: live candle helpers ignores out-of-order streaming ticks instead of appending stale candles
statusReason: expected 199 to be 102 // Object.is equality

[Killed] EqualityOperator
src/features/trade/live-candles.ts:363:10
   // The bucket-current synthetic tail may be far ahead of a stale Matrix seed;
   // the first broker tick should mutate that tail instead of being discarded.
   const interval = Math.max(1, Math.floor(intervalSeconds));
-  return last.time - previous.time > interval;
+  return last.time - previous.time >= interval;
 }
 
killedBy: live candle helpers ignores out-of-order streaming ticks instead of appending stale candles
statusReason: expected 199 to be 102 // Object.is equality

[Killed] ArithmeticOperator
src/features/trade/live-candles.ts:363:10
   // The bucket-current synthetic tail may be far ahead of a stale Matrix seed;
   // the first broker tick should mutate that tail instead of being discarded.
   const interval = Math.max(1, Math.floor(intervalSeconds));
-  return last.time - previous.time > interval;
+  return last.time + previous.time > interval;
 }
 
killedBy: live candle helpers ignores out-of-order streaming ticks instead of appending stale candles
statusReason: expected 199 to be 102 // Object.is equality
