[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:144:7
   if (overlay) return overlay;
   const sticky = stickyRef.current;
   if (!sticky) return null;
-  if (shouldReleaseStickyOverlay(sticky, nowMs)) {
+  if (false) {
     stickyRef.current = null;
     return null;
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) releases active_trade sticky after expiry plus settling grace
statusReason: expected { stage: 'active_trade', …(3) } to be null

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:144:7
   if (overlay) return overlay;
   const sticky = stickyRef.current;
   if (!sticky) return null;
-  if (shouldReleaseStickyOverlay(sticky, nowMs)) {
+  if (true) {
     stickyRef.current = null;
     return null;
killedBy: robot visual flow real-trade overlay release issue #191: keeps active_trade through a late poll dropout before expiry
statusReason: expected 'analyzing' to be 'active_trade' // Object.is equality

[Killed] EqualityOperator
robot/components/flow/sticky-overlay-guard.ts:153:7
   // rebuilds the overlay with current `nowMs` so the timer keeps ticking.
   // For `result` stickys, only replay during the cooldown window
   // (hasPendingTradeInCache gates against a stale result through idle).
-  if (sticky.capturedStage === "active_trade") {
+  if (sticky.capturedStage !== "active_trade") {
     return rebuilder({
       tradeView: sticky.tradeView,
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) R262 v2: replays active_trade sticky even when upstream cache reads false (transient null window)
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] BlockStatement
robot/components/flow/sticky-overlay-guard.ts:153:48
   // rebuilds the overlay with current `nowMs` so the timer keeps ticking.
   // For `result` stickys, only replay during the cooldown window
   // (hasPendingTradeInCache gates against a stale result through idle).
-  if (sticky.capturedStage === "active_trade") {
-    return rebuilder({
-      tradeView: sticky.tradeView,
-      sessionProfitCents: sticky.sessionProfitCents,
-      nowMs,
-    });
-  }
+  if (sticky.capturedStage === "active_trade") {}
   if (!hasPendingTradeInCache) return null;
   return rebuilder({
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) R262 v2: replays active_trade sticky even when upstream cache reads false (transient null window)
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] BooleanLiteral
robot/components/flow/sticky-overlay-guard.ts:160:7
       nowMs,
     });
   }
-  if (!hasPendingTradeInCache) return null;
+  if (hasPendingTradeInCache) return null;
   return rebuilder({
     tradeView: sticky.tradeView,
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) R262 v2: result sticky still requires hasPendingTradeInCache to avoid replaying past cooldown
statusReason: expected { stage: 'result', …(4) } to be null

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:160:7
       nowMs,
     });
   }
-  if (!hasPendingTradeInCache) return null;
+  if (false) return null;
   return rebuilder({
     tradeView: sticky.tradeView,
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) R262 v2: result sticky still requires hasPendingTradeInCache to avoid replaying past cooldown
statusReason: expected { stage: 'result', …(4) } to be null

[NoCoverage] ObjectLiteral
robot/components/flow/sticky-overlay-guard.ts:161:20
     });
   }
   if (!hasPendingTradeInCache) return null;
-  return rebuilder({
-    tradeView: sticky.tradeView,
-    sessionProfitCents: sticky.sessionProfitCents,
-    nowMs,
-  });
+  return rebuilder({});
 }
 

[Killed] BlockStatement
robot/components/flow/sticky-overlay-guard.ts:171:12
 function shouldReleaseStickyOverlay(
   sticky: StickyOverlayState,
   nowMs: number,
-): boolean {
-  if (sticky.capturedStage !== "active_trade") {
-    return nowMs - sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
-  }
-  const releaseAtMs = activeTradeReleaseAtMs(sticky.tradeView);
-  if (releaseAtMs === null)
-    return nowMs - sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
-  return nowMs >= releaseAtMs;
-}
+): boolean {}
 
 function activeTradeReleaseAtMs(tradeView: TradeView): number | null {
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) releases active_trade sticky after expiry plus settling grace
statusReason: expected { stage: 'active_trade', …(3) } to be null

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:172:7
   sticky: StickyOverlayState,
   nowMs: number,
 ): boolean {
-  if (sticky.capturedStage !== "active_trade") {
+  if (true) {
     return nowMs - sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
   }
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) issue #191: keeps active_trade sticky past TTL before expiry
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] EqualityOperator
robot/components/flow/sticky-overlay-guard.ts:172:7
   sticky: StickyOverlayState,
   nowMs: number,
 ): boolean {
-  if (sticky.capturedStage !== "active_trade") {
+  if (sticky.capturedStage === "active_trade") {
     return nowMs - sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
   }
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) issue #191: keeps active_trade sticky past TTL before expiry
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] ArithmeticOperator
robot/components/flow/sticky-overlay-guard.ts:173:12
   nowMs: number,
 ): boolean {
   if (sticky.capturedStage !== "active_trade") {
-    return nowMs - sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
+    return nowMs + sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
   }
   const releaseAtMs = activeTradeReleaseAtMs(sticky.tradeView);
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) R262 v4: sticky transitions to result and drops cleanly when upstream observes settle (no infinite active_trade)
statusReason: expected undefined to be 'result' // Object.is equality

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:173:12
   nowMs: number,
 ): boolean {
   if (sticky.capturedStage !== "active_trade") {
-    return nowMs - sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
+    return true;
   }
   const releaseAtMs = activeTradeReleaseAtMs(sticky.tradeView);
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) R262 v4: sticky transitions to result and drops cleanly when upstream observes settle (no infinite active_trade)
statusReason: expected undefined to be 'result' // Object.is equality

[Killed] EqualityOperator
robot/components/flow/sticky-overlay-guard.ts:176:7
     return nowMs - sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
   }
   const releaseAtMs = activeTradeReleaseAtMs(sticky.tradeView);
-  if (releaseAtMs === null)
+  if (releaseAtMs !== null)
     return nowMs - sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
   return nowMs >= releaseAtMs;
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) issue #191: keeps active_trade sticky past TTL before expiry
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:176:7
     return nowMs - sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
   }
   const releaseAtMs = activeTradeReleaseAtMs(sticky.tradeView);
-  if (releaseAtMs === null)
+  if (true)
     return nowMs - sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
   return nowMs >= releaseAtMs;
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) issue #191: keeps active_trade sticky past TTL before expiry
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] EqualityOperator
robot/components/flow/sticky-overlay-guard.ts:177:12
   }
   const releaseAtMs = activeTradeReleaseAtMs(sticky.tradeView);
   if (releaseAtMs === null)
-    return nowMs - sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
+    return nowMs - sticky.observedAtMs > STICKY_OVERLAY_TTL_MS;
   return nowMs >= releaseAtMs;
 }
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) uses TTL release when expiry metadata is invalid
statusReason: expected { stage: 'active_trade', …(3) } to be null

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:177:12
   }
   const releaseAtMs = activeTradeReleaseAtMs(sticky.tradeView);
   if (releaseAtMs === null)
-    return nowMs - sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
+    return false;
   return nowMs >= releaseAtMs;
 }
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) uses TTL release when expiry metadata is invalid
statusReason: expected { stage: 'active_trade', …(3) } to be null

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:178:10
   const releaseAtMs = activeTradeReleaseAtMs(sticky.tradeView);
   if (releaseAtMs === null)
     return nowMs - sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
-  return nowMs >= releaseAtMs;
+  return true;
 }
 
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) R262: replay ticks the timer down using the stored TradeView and current nowMs
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] EqualityOperator
robot/components/flow/sticky-overlay-guard.ts:178:10
   const releaseAtMs = activeTradeReleaseAtMs(sticky.tradeView);
   if (releaseAtMs === null)
     return nowMs - sticky.observedAtMs >= STICKY_OVERLAY_TTL_MS;
-  return nowMs >= releaseAtMs;
+  return nowMs > releaseAtMs;
 }
 
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) releases active_trade sticky after expiry plus settling grace
statusReason: expected { stage: 'active_trade', …(3) } to be null

[Killed] BlockStatement
robot/components/flow/sticky-overlay-guard.ts:181:70
   return nowMs >= releaseAtMs;
 }
 
-function activeTradeReleaseAtMs(tradeView: TradeView): number | null {
-  const expiresAtMs = readTradeExpiryMs(tradeView);
-  if (expiresAtMs === null) return null;
-  return expiresAtMs + ACTIVE_TRADE_STICKY_SETTLING_GRACE_MS;
-}
+function activeTradeReleaseAtMs(tradeView: TradeView): number | null {}
 
 function readTradeExpiryMs(tradeView: TradeView): number | null {
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) releases active_trade sticky after expiry plus settling grace
statusReason: expected { stage: 'active_trade', …(3) } to be null

[Killed] EqualityOperator
robot/components/flow/sticky-overlay-guard.ts:183:7
 
 function activeTradeReleaseAtMs(tradeView: TradeView): number | null {
   const expiresAtMs = readTradeExpiryMs(tradeView);
-  if (expiresAtMs === null) return null;
+  if (expiresAtMs !== null) return null;
   return expiresAtMs + ACTIVE_TRADE_STICKY_SETTLING_GRACE_MS;
 }
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) issue #191: keeps active_trade sticky past TTL before expiry
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:183:7
 
 function activeTradeReleaseAtMs(tradeView: TradeView): number | null {
   const expiresAtMs = readTradeExpiryMs(tradeView);
-  if (expiresAtMs === null) return null;
+  if (true) return null;
   return expiresAtMs + ACTIVE_TRADE_STICKY_SETTLING_GRACE_MS;
 }
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) issue #191: keeps active_trade sticky past TTL before expiry
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] ArithmeticOperator
robot/components/flow/sticky-overlay-guard.ts:184:10
 function activeTradeReleaseAtMs(tradeView: TradeView): number | null {
   const expiresAtMs = readTradeExpiryMs(tradeView);
   if (expiresAtMs === null) return null;
-  return expiresAtMs + ACTIVE_TRADE_STICKY_SETTLING_GRACE_MS;
+  return expiresAtMs - ACTIVE_TRADE_STICKY_SETTLING_GRACE_MS;
 }
 
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) issue #191: keeps active_trade sticky past TTL before expiry
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] BlockStatement
robot/components/flow/sticky-overlay-guard.ts:187:65
   return expiresAtMs + ACTIVE_TRADE_STICKY_SETTLING_GRACE_MS;
 }
 
-function readTradeExpiryMs(tradeView: TradeView): number | null {
-  if (typeof tradeView.expirationTimestamp === "number") {
-    return tradeView.expirationTimestamp;
-  }
-  if (tradeView.serverExpirationTimestamp) {
-    return parseFiniteTimestamp(tradeView.serverExpirationTimestamp);
-  }
-  return readCreatedExpiryMs(tradeView);
-}
+function readTradeExpiryMs(tradeView: TradeView): number | null {}
 
 function readCreatedExpiryMs(tradeView: TradeView): number | null {
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) releases active_trade sticky after expiry plus settling grace
statusReason: expected { stage: 'active_trade', …(3) } to be null

[Killed] EqualityOperator
robot/components/flow/sticky-overlay-guard.ts:188:7
 }
 
 function readTradeExpiryMs(tradeView: TradeView): number | null {
-  if (typeof tradeView.expirationTimestamp === "number") {
+  if (typeof tradeView.expirationTimestamp !== "number") {
     return tradeView.expirationTimestamp;
   }
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) issue #191: uses serverExpirationTimestamp when numeric expiry is absent
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] BlockStatement
robot/components/flow/sticky-overlay-guard.ts:188:58
 }
 
 function readTradeExpiryMs(tradeView: TradeView): number | null {
-  if (typeof tradeView.expirationTimestamp === "number") {
-    return tradeView.expirationTimestamp;
-  }
+  if (typeof tradeView.expirationTimestamp === "number") {}
   if (tradeView.serverExpirationTimestamp) {
     return parseFiniteTimestamp(tradeView.serverExpirationTimestamp);
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) R262 v3.1: gate-suppressed overlay with NEW pending trade in cache captures fresh active_trade
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:191:7
   if (typeof tradeView.expirationTimestamp === "number") {
     return tradeView.expirationTimestamp;
   }
-  if (tradeView.serverExpirationTimestamp) {
+  if (true) {
     return parseFiniteTimestamp(tradeView.serverExpirationTimestamp);
   }
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) issue #191: falls back to createdAt plus expirationSeconds
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:191:7
   if (typeof tradeView.expirationTimestamp === "number") {
     return tradeView.expirationTimestamp;
   }
-  if (tradeView.serverExpirationTimestamp) {
+  if (false) {
     return parseFiniteTimestamp(tradeView.serverExpirationTimestamp);
   }
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) issue #191: uses serverExpirationTimestamp when numeric expiry is absent
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] BlockStatement
robot/components/flow/sticky-overlay-guard.ts:197:67
   return readCreatedExpiryMs(tradeView);
 }
 
-function readCreatedExpiryMs(tradeView: TradeView): number | null {
-  const expirationSeconds = tradeView.expirationSeconds ?? 0;
-  const createdAtMs = parseFiniteTimestamp(tradeView.createdAt);
-  if (expirationSeconds <= 0 || createdAtMs === null) return null;
-  return createdAtMs + expirationSeconds * 1_000;
-}
+function readCreatedExpiryMs(tradeView: TradeView): number | null {}
 
 function parseFiniteTimestamp(value: string): number | null {
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) uses TTL release when expiry metadata is invalid
statusReason: expected { stage: 'active_trade', …(3) } to be null

[Killed] LogicalOperator
robot/components/flow/sticky-overlay-guard.ts:198:29
 }
 
 function readCreatedExpiryMs(tradeView: TradeView): number | null {
-  const expirationSeconds = tradeView.expirationSeconds ?? 0;
+  const expirationSeconds = tradeView.expirationSeconds && 0;
   const createdAtMs = parseFiniteTimestamp(tradeView.createdAt);
   if (expirationSeconds <= 0 || createdAtMs === null) return null;
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) issue #191: falls back to createdAt plus expirationSeconds
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] EqualityOperator
robot/components/flow/sticky-overlay-guard.ts:200:7
 function readCreatedExpiryMs(tradeView: TradeView): number | null {
   const expirationSeconds = tradeView.expirationSeconds ?? 0;
   const createdAtMs = parseFiniteTimestamp(tradeView.createdAt);
-  if (expirationSeconds <= 0 || createdAtMs === null) return null;
+  if (expirationSeconds > 0 || createdAtMs === null) return null;
   return createdAtMs + expirationSeconds * 1_000;
 }
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) issue #191: falls back to createdAt plus expirationSeconds
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] EqualityOperator
robot/components/flow/sticky-overlay-guard.ts:200:33
 function readCreatedExpiryMs(tradeView: TradeView): number | null {
   const expirationSeconds = tradeView.expirationSeconds ?? 0;
   const createdAtMs = parseFiniteTimestamp(tradeView.createdAt);
-  if (expirationSeconds <= 0 || createdAtMs === null) return null;
+  if (expirationSeconds <= 0 || createdAtMs !== null) return null;
   return createdAtMs + expirationSeconds * 1_000;
 }
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) issue #191: falls back to createdAt plus expirationSeconds
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Killed] ArithmeticOperator
robot/components/flow/sticky-overlay-guard.ts:201:10
   const expirationSeconds = tradeView.expirationSeconds ?? 0;
   const createdAtMs = parseFiniteTimestamp(tradeView.createdAt);
   if (expirationSeconds <= 0 || createdAtMs === null) return null;
-  return createdAtMs + expirationSeconds * 1_000;
+  return createdAtMs - expirationSeconds * 1_000;
 }
 
killedBy: reconcileStickyOverlay (R261/R262 architecture invariant) issue #191: falls back to createdAt plus expirationSeconds
statusReason: expected undefined to be 'active_trade' // Object.is equality

[Survived] ArithmeticOperator
robot/components/flow/sticky-overlay-guard.ts:201:24
   const expirationSeconds = tradeView.expirationSeconds ?? 0;
   const createdAtMs = parseFiniteTimestamp(tradeView.createdAt);
   if (expirationSeconds <= 0 || createdAtMs === null) return null;
-  return createdAtMs + expirationSeconds * 1_000;
+  return createdAtMs + expirationSeconds / 1_000;
 }
 

[Survived] BlockStatement
robot/components/flow/sticky-overlay-guard.ts:204:61
   return createdAtMs + expirationSeconds * 1_000;
 }
 
-function parseFiniteTimestamp(value: string): number | null {
-  const parsed = Date.parse(value);
-  return Number.isFinite(parsed) ? parsed : null;
-}
+function parseFiniteTimestamp(value: string): number | null {}
 
 /** Forget the cached "sticky overlay" state. Tests only — the SPA relies

[Killed] BooleanLiteral
robot/components/flow/sticky-overlay-guard.ts:231:7
   readonly hasPendingTradeInCache: boolean;
 }): void {
   const { prev, next, hasPendingTradeInCache } = params;
-  if (!hasPendingTradeInCache) return;
+  if (hasPendingTradeInCache) return;
   const forbiddenNext = next === "analyzing" || next === "signal";
   const isBackslide =
killedBy: assertNoStageBackslide (R261 contract enforcement) throws on active_trade -> analyzing while a trade is pending
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:231:7
   readonly hasPendingTradeInCache: boolean;
 }): void {
   const { prev, next, hasPendingTradeInCache } = params;
-  if (!hasPendingTradeInCache) return;
+  if (false) return;
   const forbiddenNext = next === "analyzing" || next === "signal";
   const isBackslide =
killedBy: assertNoStageBackslide (R261 contract enforcement) does not throw when no pending trade is in cache (post-trade idle)
statusReason: expected [Function] to not throw an error but 'Error: Robot visual flow regressed fr…' was thrown

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:232:25
 }): void {
   const { prev, next, hasPendingTradeInCache } = params;
   if (!hasPendingTradeInCache) return;
-  const forbiddenNext = next === "analyzing" || next === "signal";
+  const forbiddenNext = false;
   const isBackslide =
     (prev === "active_trade" || prev === "result") && forbiddenNext;
killedBy: assertNoStageBackslide (R261 contract enforcement) throws on active_trade -> analyzing while a trade is pending
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:232:25
 }): void {
   const { prev, next, hasPendingTradeInCache } = params;
   if (!hasPendingTradeInCache) return;
-  const forbiddenNext = next === "analyzing" || next === "signal";
+  const forbiddenNext = false || next === "signal";
   const isBackslide =
     (prev === "active_trade" || prev === "result") && forbiddenNext;
killedBy: assertNoStageBackslide (R261 contract enforcement) throws on active_trade -> analyzing while a trade is pending
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:234:5
   if (!hasPendingTradeInCache) return;
   const forbiddenNext = next === "analyzing" || next === "signal";
   const isBackslide =
-    (prev === "active_trade" || prev === "result") && forbiddenNext;
+    false;
   if (!isBackslide) return;
   throw new Error(
killedBy: assertNoStageBackslide (R261 contract enforcement) throws on active_trade -> analyzing while a trade is pending
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:234:33
   if (!hasPendingTradeInCache) return;
   const forbiddenNext = next === "analyzing" || next === "signal";
   const isBackslide =
-    (prev === "active_trade" || prev === "result") && forbiddenNext;
+    (prev === "active_trade" || false) && forbiddenNext;
   if (!isBackslide) return;
   throw new Error(
killedBy: assertNoStageBackslide (R261 contract enforcement) throws on result -> signal while a trade is pending
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
robot/components/flow/sticky-overlay-guard.ts:235:7
   const forbiddenNext = next === "analyzing" || next === "signal";
   const isBackslide =
     (prev === "active_trade" || prev === "result") && forbiddenNext;
-  if (!isBackslide) return;
+  if (false) return;
   throw new Error(
     `Robot visual flow regressed from ${prev} to ${next} while a pending trade is in cache; expected sticky-overlay guard to hold the prior stage`,
killedBy: assertNoStageBackslide (R261 contract enforcement) does not throw on the legitimate active_trade -> result transition
statusReason: expected [Function] to not throw an error but 'Error: Robot visual flow regressed fr…' was thrown

[Killed] BooleanLiteral
robot/components/flow/sticky-overlay-guard.ts:235:7
   const forbiddenNext = next === "analyzing" || next === "signal";
   const isBackslide =
     (prev === "active_trade" || prev === "result") && forbiddenNext;
-  if (!isBackslide) return;
+  if (isBackslide) return;
   throw new Error(
     `Robot visual flow regressed from ${prev} to ${next} while a pending trade is in cache; expected sticky-overlay guard to hold the prior stage`,
killedBy: assertNoStageBackslide (R261 contract enforcement) throws on active_trade -> analyzing while a trade is pending
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
robot/components/flow/sticky-overlay-guard.ts:237:5
     (prev === "active_trade" || prev === "result") && forbiddenNext;
   if (!isBackslide) return;
   throw new Error(
-    `Robot visual flow regressed from ${prev} to ${next} while a pending trade is in cache; expected sticky-overlay guard to hold the prior stage`,
+    ``,
   );
 }
killedBy: assertNoStageBackslide (R261 contract enforcement) throws on active_trade -> analyzing while a trade is pending
statusReason: expected [Function] to throw error matching /regressed from active_trade to analyz…/ but got ''
