[Killed] ArrowFunction
features/robot/components/LiveWinsTicker.tsx:62:27
   // freshly each page-load.
   const [seed] = useState(generateInitialSeed);
   const [runId, restartTicker] = useTickerAnimationRestart();
-  const entries = useMemo(() => buildEntries(seed), [seed]);
+  const entries = useMemo(() => undefined, [seed]);
   const durationMs = useMemo(resolveTickerDurationMs, []);
   useTickerBrowserResume(restartTicker);
killedBy: LiveWinsTicker / layout renderiza badge GANHOS AO VIVO (P0-56) + dois rails (issue #18: single-rail duplicado)
statusReason: Cannot read properties of undefined (reading 'map')

[Survived] ArrayDeclaration
features/robot/components/LiveWinsTicker.tsx:63:55
   const [seed] = useState(generateInitialSeed);
   const [runId, restartTicker] = useTickerAnimationRestart();
   const entries = useMemo(() => buildEntries(seed), [seed]);
-  const durationMs = useMemo(resolveTickerDurationMs, []);
+  const durationMs = useMemo(resolveTickerDurationMs, ["Stryker was here"]);
   useTickerBrowserResume(restartTicker);
   useTickerScrollResume(restartTicker);

[Killed] StringLiteral
features/robot/components/LiveWinsTicker.tsx:85:18
           style={TICKER_VIEWPORT_STYLE}
         >
           <TickerRail
-            key={`visible-${runId}`}
+            key={``}
             durationMs={durationMs}
             entries={entries}
killedBy: LiveWinsTicker / determinism + diversity issue #192: remonta rails quando o WebView cancela a animação
statusReason: expected <ul …(4)>…(6)</ul> not to be <ul …(4)>…(6)</ul> // Object.is equality

[Survived] StringLiteral
features/robot/components/LiveWinsTicker.tsx:92:18
             runId={runId}
           />
           <TickerRail
-            key={`hidden-${runId}`}
+            key={``}
             durationMs={durationMs}
             entries={entries}

[Killed] BlockStatement
features/robot/components/LiveWinsTicker.tsx:105:69
   );
 }
 
-function useTickerAnimationRestart(): readonly [number, () => void] {
-  const [runId, setRunId] = useState(0);
-  const restartTicker = useCallback(() => {
-    setRunId((current) => (current + 1) % TICKER_RESTART_MODULO);
-  }, []);
-  return [runId, restartTicker] as const;
-}
+function useTickerAnimationRestart(): readonly [number, () => void] {}
 
 function useTickerBrowserResume(onResume: () => void): void {
killedBy: LiveWinsTicker / layout renderiza badge GANHOS AO VIVO (P0-56) + dois rails (issue #18: single-rail duplicado)
statusReason: useTickerAnimationRestart is not a function or its return value is not iterable

[Killed] BlockStatement
features/robot/components/LiveWinsTicker.tsx:107:43
 
 function useTickerAnimationRestart(): readonly [number, () => void] {
   const [runId, setRunId] = useState(0);
-  const restartTicker = useCallback(() => {
-    setRunId((current) => (current + 1) % TICKER_RESTART_MODULO);
-  }, []);
+  const restartTicker = useCallback(() => {}, []);
   return [runId, restartTicker] as const;
 }
killedBy: LiveWinsTicker / determinism + diversity issue #192: remonta rails quando o WebView cancela a animação
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "1") // element.getAttribute("data-ticker-run-id") === "1"

Expected the element to have attribute:
  data-ticker-run-id="1"
Received:
  data-ticker-run-id="0"

[Killed] ArithmeticOperator
features/robot/components/LiveWinsTicker.tsx:108:28
 function useTickerAnimationRestart(): readonly [number, () => void] {
   const [runId, setRunId] = useState(0);
   const restartTicker = useCallback(() => {
-    setRunId((current) => (current + 1) % TICKER_RESTART_MODULO);
+    setRunId((current) => (current - 1) % TICKER_RESTART_MODULO);
   }, []);
   return [runId, restartTicker] as const;
killedBy: LiveWinsTicker / determinism + diversity issue #192: remonta rails quando o WebView cancela a animação
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "1") // element.getAttribute("data-ticker-run-id") === "1"

Expected the element to have attribute:
  data-ticker-run-id="1"
Received:
  data-ticker-run-id="-1"

[Killed] ArrowFunction
features/robot/components/LiveWinsTicker.tsx:108:14
 function useTickerAnimationRestart(): readonly [number, () => void] {
   const [runId, setRunId] = useState(0);
   const restartTicker = useCallback(() => {
-    setRunId((current) => (current + 1) % TICKER_RESTART_MODULO);
+    setRunId(() => undefined);
   }, []);
   return [runId, restartTicker] as const;
killedBy: LiveWinsTicker / determinism + diversity issue #192: remonta rails quando o WebView cancela a animação
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "1") // element.getAttribute("data-ticker-run-id") === "1"

Expected the element to have attribute:
  data-ticker-run-id="1"
Received:
  null

[Survived] ArrayDeclaration
features/robot/components/LiveWinsTicker.tsx:109:6
   const [runId, setRunId] = useState(0);
   const restartTicker = useCallback(() => {
     setRunId((current) => (current + 1) % TICKER_RESTART_MODULO);
-  }, []);
+  }, ["Stryker was here"]);
   return [runId, restartTicker] as const;
 }

[Killed] BlockStatement
features/robot/components/LiveWinsTicker.tsx:113:61
   return [runId, restartTicker] as const;
 }
 
-function useTickerBrowserResume(onResume: () => void): void {
-  useEffect(() => {
-    const resumeIfVisible = () => {
-      if (document.visibilityState !== "hidden") onResume();
-    };
-    document.addEventListener("visibilitychange", resumeIfVisible);
-    window.addEventListener("pageshow", resumeIfVisible);
-    window.addEventListener("focus", resumeIfVisible);
-    return () => {
-      document.removeEventListener("visibilitychange", resumeIfVisible);
-      window.removeEventListener("pageshow", resumeIfVisible);
-      window.removeEventListener("focus", resumeIfVisible);
-    };
-  }, [onResume]);
-}
+function useTickerBrowserResume(onResume: () => void): void {}
 
 function useTickerScrollResume(onResume: () => void): void {
killedBy: LiveWinsTicker / determinism + diversity issue #192: retoma ticker depois de scroll e retorno de aba
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "2") // element.getAttribute("data-ticker-run-id") === "2"

Expected the element to have attribute:
  data-ticker-run-id="2"
Received:
  data-ticker-run-id="1"

[Killed] BlockStatement
features/robot/components/LiveWinsTicker.tsx:114:19
 }
 
 function useTickerBrowserResume(onResume: () => void): void {
-  useEffect(() => {
-    const resumeIfVisible = () => {
-      if (document.visibilityState !== "hidden") onResume();
-    };
-    document.addEventListener("visibilitychange", resumeIfVisible);
-    window.addEventListener("pageshow", resumeIfVisible);
-    window.addEventListener("focus", resumeIfVisible);
-    return () => {
-      document.removeEventListener("visibilitychange", resumeIfVisible);
-      window.removeEventListener("pageshow", resumeIfVisible);
-      window.removeEventListener("focus", resumeIfVisible);
-    };
-  }, [onResume]);
+  useEffect(() => {}, [onResume]);
 }
 
killedBy: LiveWinsTicker / determinism + diversity issue #192: retoma ticker depois de scroll e retorno de aba
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "2") // element.getAttribute("data-ticker-run-id") === "2"

Expected the element to have attribute:
  data-ticker-run-id="2"
Received:
  data-ticker-run-id="1"

[Killed] BlockStatement
features/robot/components/LiveWinsTicker.tsx:115:35
 
 function useTickerBrowserResume(onResume: () => void): void {
   useEffect(() => {
-    const resumeIfVisible = () => {
-      if (document.visibilityState !== "hidden") onResume();
-    };
+    const resumeIfVisible = () => {};
     document.addEventListener("visibilitychange", resumeIfVisible);
     window.addEventListener("pageshow", resumeIfVisible);
killedBy: LiveWinsTicker / determinism + diversity issue #192: retoma ticker depois de scroll e retorno de aba
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "2") // element.getAttribute("data-ticker-run-id") === "2"

Expected the element to have attribute:
  data-ticker-run-id="2"
Received:
  data-ticker-run-id="1"

[Killed] ConditionalExpression
features/robot/components/LiveWinsTicker.tsx:116:11
 function useTickerBrowserResume(onResume: () => void): void {
   useEffect(() => {
     const resumeIfVisible = () => {
-      if (document.visibilityState !== "hidden") onResume();
+      if (true) onResume();
     };
     document.addEventListener("visibilitychange", resumeIfVisible);
killedBy: LiveWinsTicker / determinism + diversity issue #192: retoma ticker depois de scroll e retorno de aba
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "1") // element.getAttribute("data-ticker-run-id") === "1"

Expected the element to have attribute:
  data-ticker-run-id="1"
Received:
  data-ticker-run-id="2"

[Killed] EqualityOperator
features/robot/components/LiveWinsTicker.tsx:116:11
 function useTickerBrowserResume(onResume: () => void): void {
   useEffect(() => {
     const resumeIfVisible = () => {
-      if (document.visibilityState !== "hidden") onResume();
+      if (document.visibilityState === "hidden") onResume();
     };
     document.addEventListener("visibilitychange", resumeIfVisible);
killedBy: LiveWinsTicker / determinism + diversity issue #192: retoma ticker depois de scroll e retorno de aba
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "1") // element.getAttribute("data-ticker-run-id") === "1"

Expected the element to have attribute:
  data-ticker-run-id="1"
Received:
  data-ticker-run-id="2"

[Killed] StringLiteral
features/robot/components/LiveWinsTicker.tsx:120:29
     };
     document.addEventListener("visibilitychange", resumeIfVisible);
     window.addEventListener("pageshow", resumeIfVisible);
-    window.addEventListener("focus", resumeIfVisible);
+    window.addEventListener("", resumeIfVisible);
     return () => {
       document.removeEventListener("visibilitychange", resumeIfVisible);
killedBy: LiveWinsTicker / determinism + diversity issue #192: retoma ticker em pageshow e focus
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "2") // element.getAttribute("data-ticker-run-id") === "2"

Expected the element to have attribute:
  data-ticker-run-id="2"
Received:
  data-ticker-run-id="1"

[Killed] BlockStatement
features/robot/components/LiveWinsTicker.tsx:121:18
     document.addEventListener("visibilitychange", resumeIfVisible);
     window.addEventListener("pageshow", resumeIfVisible);
     window.addEventListener("focus", resumeIfVisible);
-    return () => {
-      document.removeEventListener("visibilitychange", resumeIfVisible);
-      window.removeEventListener("pageshow", resumeIfVisible);
-      window.removeEventListener("focus", resumeIfVisible);
-    };
+    return () => {};
   }, [onResume]);
 }
killedBy: LiveWinsTicker / determinism + diversity issue #192: limpa listeners de retomada ao desmontar
statusReason: expected "removeEventListener" to be called with arguments: [ 'visibilitychange', Any<Function> ]

Received: 

  1st removeEventListener call:

  [
-   "visibilitychange",

[Killed] StringLiteral
features/robot/components/LiveWinsTicker.tsx:122:36
     window.addEventListener("pageshow", resumeIfVisible);
     window.addEventListener("focus", resumeIfVisible);
     return () => {
-      document.removeEventListener("visibilitychange", resumeIfVisible);
+      document.removeEventListener("", resumeIfVisible);
       window.removeEventListener("pageshow", resumeIfVisible);
       window.removeEventListener("focus", resumeIfVisible);
killedBy: LiveWinsTicker / determinism + diversity issue #192: limpa listeners de retomada ao desmontar
statusReason: expected "removeEventListener" to be called with arguments: [ 'visibilitychange', Any<Function> ]

Received: 

  1st removeEventListener call:

  [
-   "visibilitychange",

[Killed] BlockStatement
features/robot/components/LiveWinsTicker.tsx:129:60
   }, [onResume]);
 }
 
-function useTickerScrollResume(onResume: () => void): void {
-  useEffect(() => {
-    let resumeTimer: number | undefined;
-    const queueResume = () => {
-      window.clearTimeout(resumeTimer);
-      resumeTimer = window.setTimeout(onResume, TICKER_SCROLL_RESUME_DELAY_MS);
-    };
-    document.addEventListener("scroll", queueResume, {
-      capture: true,
-      passive: true,
-    });
-    return () => {
-      window.clearTimeout(resumeTimer);
-      document.removeEventListener("scroll", queueResume, true);
-    };
-  }, [onResume]);
-}
+function useTickerScrollResume(onResume: () => void): void {}
 
 function TickerBadge(): React.JSX.Element {
killedBy: LiveWinsTicker / determinism + diversity issue #192: retoma ticker depois de scroll e retorno de aba
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "1") // element.getAttribute("data-ticker-run-id") === "1"

Expected the element to have attribute:
  data-ticker-run-id="1"
Received:
  data-ticker-run-id="0"

[Killed] BlockStatement
features/robot/components/LiveWinsTicker.tsx:130:19
 }
 
 function useTickerScrollResume(onResume: () => void): void {
-  useEffect(() => {
-    let resumeTimer: number | undefined;
-    const queueResume = () => {
-      window.clearTimeout(resumeTimer);
-      resumeTimer = window.setTimeout(onResume, TICKER_SCROLL_RESUME_DELAY_MS);
-    };
-    document.addEventListener("scroll", queueResume, {
-      capture: true,
-      passive: true,
-    });
-    return () => {
-      window.clearTimeout(resumeTimer);
-      document.removeEventListener("scroll", queueResume, true);
-    };
-  }, [onResume]);
+  useEffect(() => {}, [onResume]);
 }
 
killedBy: LiveWinsTicker / determinism + diversity issue #192: retoma ticker depois de scroll e retorno de aba
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "1") // element.getAttribute("data-ticker-run-id") === "1"

Expected the element to have attribute:
  data-ticker-run-id="1"
Received:
  data-ticker-run-id="0"

[Killed] BlockStatement
features/robot/components/LiveWinsTicker.tsx:132:31
 function useTickerScrollResume(onResume: () => void): void {
   useEffect(() => {
     let resumeTimer: number | undefined;
-    const queueResume = () => {
-      window.clearTimeout(resumeTimer);
-      resumeTimer = window.setTimeout(onResume, TICKER_SCROLL_RESUME_DELAY_MS);
-    };
+    const queueResume = () => {};
     document.addEventListener("scroll", queueResume, {
       capture: true,
killedBy: LiveWinsTicker / determinism + diversity issue #192: retoma ticker depois de scroll e retorno de aba
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "1") // element.getAttribute("data-ticker-run-id") === "1"

Expected the element to have attribute:
  data-ticker-run-id="1"
Received:
  data-ticker-run-id="0"

[Killed] StringLiteral
features/robot/components/LiveWinsTicker.tsx:136:31
       window.clearTimeout(resumeTimer);
       resumeTimer = window.setTimeout(onResume, TICKER_SCROLL_RESUME_DELAY_MS);
     };
-    document.addEventListener("scroll", queueResume, {
+    document.addEventListener("", queueResume, {
       capture: true,
       passive: true,
killedBy: LiveWinsTicker / determinism + diversity issue #192: retoma ticker depois de scroll e retorno de aba
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "1") // element.getAttribute("data-ticker-run-id") === "1"

Expected the element to have attribute:
  data-ticker-run-id="1"
Received:
  data-ticker-run-id="0"

[Survived] BooleanLiteral
features/robot/components/LiveWinsTicker.tsx:137:16
       resumeTimer = window.setTimeout(onResume, TICKER_SCROLL_RESUME_DELAY_MS);
     };
     document.addEventListener("scroll", queueResume, {
-      capture: true,
+      capture: false,
       passive: true,
     });

[Survived] BooleanLiteral
features/robot/components/LiveWinsTicker.tsx:138:16
     };
     document.addEventListener("scroll", queueResume, {
       capture: true,
-      passive: true,
+      passive: false,
     });
     return () => {

[Killed] BlockStatement
features/robot/components/LiveWinsTicker.tsx:140:18
       capture: true,
       passive: true,
     });
-    return () => {
-      window.clearTimeout(resumeTimer);
-      document.removeEventListener("scroll", queueResume, true);
-    };
+    return () => {};
   }, [onResume]);
 }
killedBy: LiveWinsTicker / determinism + diversity issue #192: limpa listeners de retomada ao desmontar
statusReason: expected "removeEventListener" to be called with arguments: [ 'scroll', Any<Function>, true ]

Received: 

  1st removeEventListener call:

  [
-   "scroll",

[Killed] BooleanLiteral
features/robot/components/LiveWinsTicker.tsx:142:59
     });
     return () => {
       window.clearTimeout(resumeTimer);
-      document.removeEventListener("scroll", queueResume, true);
+      document.removeEventListener("scroll", queueResume, false);
     };
   }, [onResume]);
killedBy: LiveWinsTicker / determinism + diversity issue #192: limpa listeners de retomada ao desmontar
statusReason: expected "removeEventListener" to be called with arguments: [ 'scroll', Any<Function>, true ]

Received: 

  1st removeEventListener call:

  [
-   "scroll",

[Killed] BlockStatement
features/robot/components/LiveWinsTicker.tsx:169:23
   readonly onAnimationCancel: () => void;
   readonly runId: number;
   readonly "aria-hidden"?: boolean;
-}): React.JSX.Element {
-  const railRef = useTickerAnimationCancel(props.onAnimationCancel);
-  return (
-    <ul
-      ref={railRef}
-      data-testid="live-wins-ticker-rail"
-      data-ticker-run-id={props.runId}
-      aria-hidden={props["aria-hidden"]}
-      className="flex shrink-0 animate-[ticker-scroll_96s_linear_infinite] gap-4 pr-4 motion-reduce:animate-none"
-      style={{ animationDuration: `${props.durationMs}ms` } as CSSProperties}
-    >
-      {props.entries.map((entry) => (
-        <TickerEntry key={entry.id} entry={entry} />
-      ))}
-    </ul>
-  );
-}
+}): React.JSX.Element {}
 
 function useTickerAnimationCancel(
killedBy: LiveWinsTicker / layout renderiza badge GANHOS AO VIVO (P0-56) + dois rails (issue #18: single-rail duplicado)
statusReason: Unable to find an element by: [data-testid="live-wins-ticker-rail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="relative overflow-hidden border-y border-white/5 bg-[#0A0A0A] px-2 py-1.5 min-[360px]:px-2.5"
      data-testid="live-wins-ticker"

[Killed] ArrowFunction
features/robot/components/LiveWinsTicker.tsx:180:26
       className="flex shrink-0 animate-[ticker-scroll_96s_linear_infinite] gap-4 pr-4 motion-reduce:animate-none"
       style={{ animationDuration: `${props.durationMs}ms` } as CSSProperties}
     >
-      {props.entries.map((entry) => (
-        <TickerEntry key={entry.id} entry={entry} />
-      ))}
+      {props.entries.map(() => undefined)}
     </ul>
   );
killedBy: LiveWinsTicker / layout G4 (#69-followup): expõe 6 entries por rail (paridade legacy, ticker mais lento)
statusReason: expected  to have a length of 6 but got +0

[Killed] BlockStatement
features/robot/components/LiveWinsTicker.tsx:189:39
 
 function useTickerAnimationCancel(
   onAnimationCancel: () => void,
-): RefObject<HTMLUListElement | null> {
-  const railRef = useRef<HTMLUListElement>(null);
-  useEffect(() => {
-    const rail = railRef.current;
-    if (!rail) return undefined;
-    rail.addEventListener("animationcancel", onAnimationCancel);
-    return () => rail.removeEventListener("animationcancel", onAnimationCancel);
-  }, [onAnimationCancel]);
-  return railRef;
-}
+): RefObject<HTMLUListElement | null> {}
 
 function TickerEntry(props: {
killedBy: LiveWinsTicker / determinism + diversity issue #192: remonta rails quando o WebView cancela a animação
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "1") // element.getAttribute("data-ticker-run-id") === "1"

Expected the element to have attribute:
  data-ticker-run-id="1"
Received:
  data-ticker-run-id="0"

[Killed] BlockStatement
features/robot/components/LiveWinsTicker.tsx:191:19
   onAnimationCancel: () => void,
 ): RefObject<HTMLUListElement | null> {
   const railRef = useRef<HTMLUListElement>(null);
-  useEffect(() => {
-    const rail = railRef.current;
-    if (!rail) return undefined;
-    rail.addEventListener("animationcancel", onAnimationCancel);
-    return () => rail.removeEventListener("animationcancel", onAnimationCancel);
-  }, [onAnimationCancel]);
+  useEffect(() => {}, [onAnimationCancel]);
   return railRef;
 }
killedBy: LiveWinsTicker / determinism + diversity issue #192: remonta rails quando o WebView cancela a animação
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "1") // element.getAttribute("data-ticker-run-id") === "1"

Expected the element to have attribute:
  data-ticker-run-id="1"
Received:
  data-ticker-run-id="0"

[Killed] ConditionalExpression
features/robot/components/LiveWinsTicker.tsx:193:9
   const railRef = useRef<HTMLUListElement>(null);
   useEffect(() => {
     const rail = railRef.current;
-    if (!rail) return undefined;
+    if (true) return undefined;
     rail.addEventListener("animationcancel", onAnimationCancel);
     return () => rail.removeEventListener("animationcancel", onAnimationCancel);
killedBy: LiveWinsTicker / determinism + diversity issue #192: remonta rails quando o WebView cancela a animação
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "1") // element.getAttribute("data-ticker-run-id") === "1"

Expected the element to have attribute:
  data-ticker-run-id="1"
Received:
  data-ticker-run-id="0"

[Killed] BooleanLiteral
features/robot/components/LiveWinsTicker.tsx:193:9
   const railRef = useRef<HTMLUListElement>(null);
   useEffect(() => {
     const rail = railRef.current;
-    if (!rail) return undefined;
+    if (rail) return undefined;
     rail.addEventListener("animationcancel", onAnimationCancel);
     return () => rail.removeEventListener("animationcancel", onAnimationCancel);
killedBy: LiveWinsTicker / determinism + diversity issue #192: remonta rails quando o WebView cancela a animação
statusReason: expect(element).toHaveAttribute("data-ticker-run-id", "1") // element.getAttribute("data-ticker-run-id") === "1"

Expected the element to have attribute:
  data-ticker-run-id="1"
Received:
  data-ticker-run-id="0"

[Survived] ArrowFunction
features/robot/components/LiveWinsTicker.tsx:195:12
     const rail = railRef.current;
     if (!rail) return undefined;
     rail.addEventListener("animationcancel", onAnimationCancel);
-    return () => rail.removeEventListener("animationcancel", onAnimationCancel);
+    return () => undefined;
   }, [onAnimationCancel]);
   return railRef;
