[Survived] ConditionalExpression
robot/components/flow/useRobotVisualFlow.ts:470:7
     baseFlow: rawBaseFlow,
     hasPendingTradeInCache,
   });
-  if (pendingHoldFlow !== rawBaseFlow) return pendingHoldFlow;
+  if (true) return pendingHoldFlow;
   return clampBaseFlowToSignal(rawBaseFlow, seed, nowMs);
 }

[Survived] ConditionalExpression
robot/components/flow/useRobotVisualFlow.ts:470:7
     baseFlow: rawBaseFlow,
     hasPendingTradeInCache,
   });
-  if (pendingHoldFlow !== rawBaseFlow) return pendingHoldFlow;
+  if (false) return pendingHoldFlow;
   return clampBaseFlowToSignal(rawBaseFlow, seed, nowMs);
 }

[Killed] StringLiteral
robot/components/flow/useRobotVisualFlow.ts:476:3
 
 const UNSAFE_PENDING_BASE_STAGES = new Set<RobotVisualFlow["stage"]>([
   "analyzing",
-  "signal",
+  "",
 ]);
 
killedBy: holdPendingTradeBaseFlow issue #191: converts unsafe signal frames to execution hold
statusReason: expected 'signal' to be 'executing' // Object.is equality

[Killed] BlockStatement
robot/components/flow/useRobotVisualFlow.ts:482:21
 export function holdPendingTradeBaseFlow(params: {
   readonly baseFlow: RobotVisualFlow;
   readonly hasPendingTradeInCache: boolean;
-}): RobotVisualFlow {
-  if (!params.hasPendingTradeInCache) return params.baseFlow;
-  if (!UNSAFE_PENDING_BASE_STAGES.has(params.baseFlow.stage)) {
-    return params.baseFlow;
-  }
-  return buildPendingTradeHoldFlow(params.baseFlow);
-}
+}): RobotVisualFlow {}
 
 function buildPendingTradeHoldFlow(baseFlow: RobotVisualFlow): RobotVisualFlow {
killedBy: useRobotPageState trade overlay opens the trade stream on the robot page for settlement events
statusReason: Cannot read properties of undefined (reading 'stage')

[Killed] BooleanLiteral
robot/components/flow/useRobotVisualFlow.ts:483:7
   readonly baseFlow: RobotVisualFlow;
   readonly hasPendingTradeInCache: boolean;
 }): RobotVisualFlow {
-  if (!params.hasPendingTradeInCache) return params.baseFlow;
+  if (params.hasPendingTradeInCache) return params.baseFlow;
   if (!UNSAFE_PENDING_BASE_STAGES.has(params.baseFlow.stage)) {
     return params.baseFlow;
killedBy: useRobotPageState trade overlay issue #190: does not start signal-candle polling during analyzing
statusReason: expected last "spy" call to have been called with [ '', '1m', 50, {} ]

[Killed] ConditionalExpression
robot/components/flow/useRobotVisualFlow.ts:483:7
   readonly baseFlow: RobotVisualFlow;
   readonly hasPendingTradeInCache: boolean;
 }): RobotVisualFlow {
-  if (!params.hasPendingTradeInCache) return params.baseFlow;
+  if (true) return params.baseFlow;
   if (!UNSAFE_PENDING_BASE_STAGES.has(params.baseFlow.stage)) {
     return params.baseFlow;
killedBy: holdPendingTradeBaseFlow issue #191: converts unsafe signal frames to execution hold
statusReason: expected 'signal' to be 'executing' // Object.is equality

[Killed] ConditionalExpression
robot/components/flow/useRobotVisualFlow.ts:484:7
   readonly hasPendingTradeInCache: boolean;
 }): RobotVisualFlow {
   if (!params.hasPendingTradeInCache) return params.baseFlow;
-  if (!UNSAFE_PENDING_BASE_STAGES.has(params.baseFlow.stage)) {
+  if (true) {
     return params.baseFlow;
   }
killedBy: holdPendingTradeBaseFlow issue #191: converts unsafe signal frames to execution hold
statusReason: expected 'signal' to be 'executing' // Object.is equality

[Killed] BlockStatement
robot/components/flow/useRobotVisualFlow.ts:484:63
   readonly hasPendingTradeInCache: boolean;
 }): RobotVisualFlow {
   if (!params.hasPendingTradeInCache) return params.baseFlow;
-  if (!UNSAFE_PENDING_BASE_STAGES.has(params.baseFlow.stage)) {
-    return params.baseFlow;
-  }
+  if (!UNSAFE_PENDING_BASE_STAGES.has(params.baseFlow.stage)) {}
   return buildPendingTradeHoldFlow(params.baseFlow);
 }
killedBy: holdPendingTradeBaseFlow issue #191: holds analyzing but leaves executing unchanged
statusReason: expected { stage: 'executing', …(6) } to be { stage: 'executing', …(9) } // Object.is equality

[Killed] BlockStatement
robot/components/flow/useRobotVisualFlow.ts:490:80
   return buildPendingTradeHoldFlow(params.baseFlow);
 }
 
-function buildPendingTradeHoldFlow(baseFlow: RobotVisualFlow): RobotVisualFlow {
-  const {
-    countdownSeconds: _countdownSeconds,
-    progressPercent: _progressPercent,
-    signal: _signal,
-    signalDisplayUntilMs: _signalDisplayUntilMs,
-    ...baseWithoutSignal
-  } = baseFlow;
-  return {
-    ...baseWithoutSignal,
-    stage: "executing",
-    statusText: "EXECUTANDO",
-    title: "Entrada em andamento",
-    detail: "Confirmando operacao na corretora...",
-  };
-}
+function buildPendingTradeHoldFlow(baseFlow: RobotVisualFlow): RobotVisualFlow {}
 
 function useFinancialStopReset(params: {
killedBy: holdPendingTradeBaseFlow issue #191: converts unsafe signal frames to execution hold
statusReason: Cannot read properties of undefined (reading 'stage')

[Survived] StringLiteral
robot/components/flow/useRobotVisualFlow.ts:501:17
   return {
     ...baseWithoutSignal,
     stage: "executing",
-    statusText: "EXECUTANDO",
+    statusText: "",
     title: "Entrada em andamento",
     detail: "Confirmando operacao na corretora...",
