[Killed] BooleanLiteral
src/features/robot/use-robot-auto-trade-binding.ts:33:13
 
 const EXECUTION_OBSERVATION_GRACE_MS = 8_000;
 const SIGNAL_CANDLE_OPTIONS: UseCandlesOptions = {
-  realtime: true,
+  realtime: false,
   refetchIntervalMs: 2_000,
 };
killedBy: resolveSignalCandleRequest issue #190: enables realtime candles during signal and executing
statusReason: expected { …(3) } to deeply equal { …(3) }

[Killed] BlockStatement
src/features/robot/use-robot-auto-trade-binding.ts:105:64
   timerRef.current = null;
 }
 
-function useSignalCandlesReady(flow: RobotVisualFlow): boolean {
-  const request = resolveSignalCandleRequest(flow);
-  const candles = useCandles(
-    request.symbol,
-    "1m",
-    LEGACY_ACTIVE_TRADE_COUNTBACK,
-    request.options,
-  );
-  if (!request.required) return true;
-  return hasCompleteRobotTradeCandles(candles.candles);
-}
+function useSignalCandlesReady(flow: RobotVisualFlow): boolean {}
 
 export function resolveSignalCandleRequest(flow: RobotVisualFlow): {
killedBy: useRobotPageState trade overlay does not arm auto trade when signal candles collapse below the legacy count
statusReason: expected last "spy" call to have been called with [ ObjectContaining{…} ]

[Killed] StringLiteral
src/features/robot/use-robot-auto-trade-binding.ts:109:5
   const request = resolveSignalCandleRequest(flow);
   const candles = useCandles(
     request.symbol,
-    "1m",
+    "",
     LEGACY_ACTIVE_TRADE_COUNTBACK,
     request.options,
killedBy: useRobotPageState trade overlay issue #190: does not start signal-candle polling during analyzing
statusReason: expected last "spy" call to have been called with [ '', '1m', 50, {} ]

[Killed] BooleanLiteral
src/features/robot/use-robot-auto-trade-binding.ts:113:7
     LEGACY_ACTIVE_TRADE_COUNTBACK,
     request.options,
   );
-  if (!request.required) return true;
+  if (request.required) return true;
   return hasCompleteRobotTradeCandles(candles.candles);
 }
killedBy: useRobotPageState trade overlay does not arm auto trade when signal candles collapse below the legacy count
statusReason: expected last "spy" call to have been called with [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/features/robot/use-robot-auto-trade-binding.ts:113:7
     LEGACY_ACTIVE_TRADE_COUNTBACK,
     request.options,
   );
-  if (!request.required) return true;
+  if (false) return true;
   return hasCompleteRobotTradeCandles(candles.candles);
 }
killedBy: useRobotPageState trade overlay issue #190: does not start signal-candle polling during analyzing
statusReason: expected last "spy" call to have been called with [ ObjectContaining{…} ]

[Killed] BlockStatement
src/features/robot/use-robot-auto-trade-binding.ts:121:3
   readonly options: UseCandlesOptions;
   readonly required: boolean;
   readonly symbol: string;
-} {
-  const signal = flow.signal;
-  if (!signal || !isSignalCandleStage(flow.stage)) {
-    return {
-      options: DISABLED_SIGNAL_CANDLE_OPTIONS,
-      required: false,
-      symbol: "",
-    };
-  }
-  return {
-    options: SIGNAL_CANDLE_OPTIONS,
-    required: true,
-    symbol: buildRobotTradeAsset(signal.asset).symbol,
-  };
-}
+} {}
 
 function isSignalCandleStage(stage: RobotVisualFlow["stage"]): boolean {
killedBy: useRobotPageState trade overlay shows POST-created pending trade while active-trade polling is delayed
statusReason: Cannot read properties of undefined (reading 'symbol')

[Killed] BooleanLiteral
src/features/robot/use-robot-auto-trade-binding.ts:123:7
   readonly symbol: string;
 } {
   const signal = flow.signal;
-  if (!signal || !isSignalCandleStage(flow.stage)) {
+  if (signal || !isSignalCandleStage(flow.stage)) {
     return {
       options: DISABLED_SIGNAL_CANDLE_OPTIONS,
killedBy: useRobotPageState trade overlay does not arm auto trade when signal candles collapse below the legacy count
statusReason: expected last "spy" call to have been called with [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/features/robot/use-robot-auto-trade-binding.ts:123:7
   readonly symbol: string;
 } {
   const signal = flow.signal;
-  if (!signal || !isSignalCandleStage(flow.stage)) {
+  if (true) {
     return {
       options: DISABLED_SIGNAL_CANDLE_OPTIONS,
killedBy: useRobotPageState trade overlay does not arm auto trade when signal candles collapse below the legacy count
statusReason: expected last "spy" call to have been called with [ ObjectContaining{…} ]

[Killed] BooleanLiteral
src/features/robot/use-robot-auto-trade-binding.ts:126:17
   if (!signal || !isSignalCandleStage(flow.stage)) {
     return {
       options: DISABLED_SIGNAL_CANDLE_OPTIONS,
-      required: false,
+      required: true,
       symbol: "",
     };
killedBy: useRobotPageState trade overlay issue #190: does not start signal-candle polling during analyzing
statusReason: expected last "spy" call to have been called with [ ObjectContaining{…} ]

[Killed] StringLiteral
src/features/robot/use-robot-auto-trade-binding.ts:127:15
     return {
       options: DISABLED_SIGNAL_CANDLE_OPTIONS,
       required: false,
-      symbol: "",
+      symbol: "Stryker was here!",
     };
   }
killedBy: useRobotPageState trade overlay issue #190: does not start signal-candle polling during analyzing
statusReason: expected last "spy" call to have been called with [ '', '1m', 50, {} ]

[Killed] ObjectLiteral
src/features/robot/use-robot-auto-trade-binding.ts:130:10
       symbol: "",
     };
   }
-  return {
-    options: SIGNAL_CANDLE_OPTIONS,
-    required: true,
-    symbol: buildRobotTradeAsset(signal.asset).symbol,
-  };
+  return {};
 }
 
killedBy: useRobotPageState trade overlay does not arm auto trade when signal candles collapse below the legacy count
statusReason: expected last "spy" call to have been called with [ ObjectContaining{…} ]

[Killed] BooleanLiteral
src/features/robot/use-robot-auto-trade-binding.ts:132:15
   }
   return {
     options: SIGNAL_CANDLE_OPTIONS,
-    required: true,
+    required: false,
     symbol: buildRobotTradeAsset(signal.asset).symbol,
   };
killedBy: useRobotPageState trade overlay does not arm auto trade when signal candles collapse below the legacy count
statusReason: expected last "spy" call to have been called with [ ObjectContaining{…} ]

[Killed] BlockStatement
src/features/robot/use-robot-auto-trade-binding.ts:137:72
   };
 }
 
-function isSignalCandleStage(stage: RobotVisualFlow["stage"]): boolean {
-  return stage === "signal" || stage === "executing";
-}
+function isSignalCandleStage(stage: RobotVisualFlow["stage"]): boolean {}
 
 function usePresentedSignalCycle(
killedBy: useRobotPageState trade overlay does not arm auto trade when signal candles collapse below the legacy count
statusReason: expected last "spy" call to have been called with [ ObjectContaining{…} ]

[Killed] ConditionalExpression
src/features/robot/use-robot-auto-trade-binding.ts:138:10
 }
 
 function isSignalCandleStage(stage: RobotVisualFlow["stage"]): boolean {
-  return stage === "signal" || stage === "executing";
+  return true;
 }
 
killedBy: useRobotPageState trade overlay issue #190: ignores active-trade signal payload for candle polling
statusReason: expected last "spy" call to have been called with [ '', '1m', 50, {} ]

[Killed] LogicalOperator
src/features/robot/use-robot-auto-trade-binding.ts:138:10
 }
 
 function isSignalCandleStage(stage: RobotVisualFlow["stage"]): boolean {
-  return stage === "signal" || stage === "executing";
+  return stage === "signal" && stage === "executing";
 }
 
killedBy: useRobotPageState trade overlay does not arm auto trade when signal candles collapse below the legacy count
statusReason: expected last "spy" call to have been called with [ ObjectContaining{…} ]
