[Killed] BlockStatement
src/lib/query/index.tsx:436:28
   k,
   refetchInterval,
   queryFn,
-}: QueryPollingOpts): void {
-  const queryFnRef = useRef(queryFn);
-  queryFnRef.current = queryFn;
-  useEffect(() => {
-    if (!enabled) return;
-    if (!refetchInterval) return;
-    const entry = qc._ensureEntry(k);
-    return registerPollingInterval({
-      qc,
-      cacheKey: k,
-      entry,
-      interval: refetchInterval,
-      queryFnRef,
-    });
-  }, [enabled, qc, k, refetchInterval]);
-}
+}: QueryPollingOpts): void {}
 
 function usePollingDocumentVisible(
killedBy: useQueryPolling keeps polling active when one consumer of the key unmounts
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/lib/query/index.tsx:439:19
 }: QueryPollingOpts): void {
   const queryFnRef = useRef(queryFn);
   queryFnRef.current = queryFn;
-  useEffect(() => {
-    if (!enabled) return;
-    if (!refetchInterval) return;
-    const entry = qc._ensureEntry(k);
-    return registerPollingInterval({
-      qc,
-      cacheKey: k,
-      entry,
-      interval: refetchInterval,
-      queryFnRef,
-    });
-  }, [enabled, qc, k, refetchInterval]);
+  useEffect(() => {}, [enabled, qc, k, refetchInterval]);
 }
 
killedBy: useQueryPolling keeps polling active when one consumer of the key unmounts
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BooleanLiteral
src/lib/query/index.tsx:440:9
   const queryFnRef = useRef(queryFn);
   queryFnRef.current = queryFn;
   useEffect(() => {
-    if (!enabled) return;
+    if (enabled) return;
     if (!refetchInterval) return;
     const entry = qc._ensureEntry(k);
killedBy: useQueryPolling keeps polling active when one consumer of the key unmounts
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/lib/query/index.tsx:441:9
   queryFnRef.current = queryFn;
   useEffect(() => {
     if (!enabled) return;
-    if (!refetchInterval) return;
+    if (false) return;
     const entry = qc._ensureEntry(k);
     return registerPollingInterval({
killedBy: useQuery stale fetch refetches once after invalidation despite rerenders
statusReason: expected 891 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/lib/query/index.tsx:441:9
   queryFnRef.current = queryFn;
   useEffect(() => {
     if (!enabled) return;
-    if (!refetchInterval) return;
+    if (refetchInterval) return;
     const entry = qc._ensureEntry(k);
     return registerPollingInterval({
killedBy: useQuery stale fetch refetches once after invalidation despite rerenders
statusReason: expected 894 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/lib/query/index.tsx:455:12
 
 function usePollingDocumentVisible(
   refetchIntervalInBackground: boolean | undefined,
-): boolean {
-  const [isVisible, setIsVisible] = useState(readDocumentVisible);
-  useEffect(() => {
-    if (refetchIntervalInBackground !== false) return;
-    const updateVisibility = () => setIsVisible(readDocumentVisible());
-    updateVisibility();
-    document.addEventListener("visibilitychange", updateVisibility);
-    return () =>
-      document.removeEventListener("visibilitychange", updateVisibility);
-  }, [refetchIntervalInBackground]);
-  return refetchIntervalInBackground === false ? isVisible : true;
-}
+): boolean {}
 
 function readDocumentVisible(): boolean {
killedBy: useQueryPolling keeps polling active when one consumer of the key unmounts
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/lib/query/index.tsx:457:19
   refetchIntervalInBackground: boolean | undefined,
 ): boolean {
   const [isVisible, setIsVisible] = useState(readDocumentVisible);
-  useEffect(() => {
-    if (refetchIntervalInBackground !== false) return;
-    const updateVisibility = () => setIsVisible(readDocumentVisible());
-    updateVisibility();
-    document.addEventListener("visibilitychange", updateVisibility);
-    return () =>
-      document.removeEventListener("visibilitychange", updateVisibility);
-  }, [refetchIntervalInBackground]);
+  useEffect(() => {}, [refetchIntervalInBackground]);
   return refetchIntervalInBackground === false ? isVisible : true;
 }
killedBy: useQueryPolling pauses polling in hidden tabs when background refetch is disabled
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/query/index.tsx:458:9
 ): boolean {
   const [isVisible, setIsVisible] = useState(readDocumentVisible);
   useEffect(() => {
-    if (refetchIntervalInBackground !== false) return;
+    if (true) return;
     const updateVisibility = () => setIsVisible(readDocumentVisible());
     updateVisibility();
killedBy: useQueryPolling pauses polling in hidden tabs when background refetch is disabled
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/lib/query/index.tsx:458:9
 ): boolean {
   const [isVisible, setIsVisible] = useState(readDocumentVisible);
   useEffect(() => {
-    if (refetchIntervalInBackground !== false) return;
+    if (refetchIntervalInBackground === false) return;
     const updateVisibility = () => setIsVisible(readDocumentVisible());
     updateVisibility();
killedBy: useQueryPolling pauses polling in hidden tabs when background refetch is disabled
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/lib/query/index.tsx:459:30
   const [isVisible, setIsVisible] = useState(readDocumentVisible);
   useEffect(() => {
     if (refetchIntervalInBackground !== false) return;
-    const updateVisibility = () => setIsVisible(readDocumentVisible());
+    const updateVisibility = () => undefined;
     updateVisibility();
     document.addEventListener("visibilitychange", updateVisibility);
killedBy: useQueryPolling pauses polling in hidden tabs when background refetch is disabled
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/lib/query/index.tsx:461:31
     if (refetchIntervalInBackground !== false) return;
     const updateVisibility = () => setIsVisible(readDocumentVisible());
     updateVisibility();
-    document.addEventListener("visibilitychange", updateVisibility);
+    document.addEventListener("", updateVisibility);
     return () =>
       document.removeEventListener("visibilitychange", updateVisibility);
killedBy: useQueryPolling pauses polling in hidden tabs when background refetch is disabled
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/lib/query/index.tsx:462:12
     const updateVisibility = () => setIsVisible(readDocumentVisible());
     updateVisibility();
     document.addEventListener("visibilitychange", updateVisibility);
-    return () =>
-      document.removeEventListener("visibilitychange", updateVisibility);
+    return () => undefined;
   }, [refetchIntervalInBackground]);
   return refetchIntervalInBackground === false ? isVisible : true;
killedBy: useQueryPolling removes the visibility listener when visible-only polling unmounts
statusReason: expected "removeEventListener" to be called with arguments: [ 'visibilitychange', Any<Function> ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/query/index.tsx:465:10
     return () =>
       document.removeEventListener("visibilitychange", updateVisibility);
   }, [refetchIntervalInBackground]);
-  return refetchIntervalInBackground === false ? isVisible : true;
+  return false ? isVisible : true;
 }
 
killedBy: useQueryPolling pauses polling in hidden tabs when background refetch is disabled
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/query/index.tsx:465:10
     return () =>
       document.removeEventListener("visibilitychange", updateVisibility);
   }, [refetchIntervalInBackground]);
-  return refetchIntervalInBackground === false ? isVisible : true;
+  return true ? isVisible : true;
 }
 
killedBy: useQueryPolling keeps default background polling active while the tab is hidden
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/query/index.tsx:470:40
 
 function readDocumentVisible(): boolean {
   return (
-    typeof document === "undefined" || document.visibilityState !== "hidden"
+    typeof document === "undefined" || false
   );
 }
killedBy: useQueryPolling pauses polling in hidden tabs when background refetch is disabled
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/lib/query/index.tsx:470:5
 
 function readDocumentVisible(): boolean {
   return (
-    typeof document === "undefined" || document.visibilityState !== "hidden"
+    typeof document === "undefined" && document.visibilityState !== "hidden"
   );
 }
killedBy: useQueryPolling pauses polling in hidden tabs when background refetch is disabled
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/lib/query/index.tsx:524:14
   );
   // Always call hook; guard is inside useQueryPolling (skips when falsy interval)
   useQueryPolling({
-    enabled: opts.enabled !== false && pollingDocumentVisible,
+    enabled: true && pollingDocumentVisible,
     qc,
     k,
killedBy: useQueryPolling does not register polling while the query is disabled
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/lib/query/index.tsx:524:14
   );
   // Always call hook; guard is inside useQueryPolling (skips when falsy interval)
   useQueryPolling({
-    enabled: opts.enabled !== false && pollingDocumentVisible,
+    enabled: true,
     qc,
     k,
killedBy: useQueryPolling does not register polling while the query is disabled
statusReason: expected 1 to be +0 // Object.is equality
