[Killed] BlockStatement
src/features/trade/live-candles.ts:294:12
 function hasLiveTickFoldedIntoTail(
   current: readonly ChartCandle[],
   nextSeed: readonly ChartCandle[],
-): boolean {
-  const currentLast = current[current.length - 1];
-  const nextLast = nextSeed[nextSeed.length - 1];
-  if (!currentLast || !nextLast) return false;
-  if (nextSeed.length !== current.length) return false;
-  if (nextLast.time !== currentLast.time) return false;
-  if (currentLast.close !== nextLast.close) return true;
-  // Wick (rabinho) protection: o tick SSE pode ter expandido high/low entre
-  // dois fetches do Matrix. Se o snapshot retorna a mesma vela mas com wick
-  // mais curto, manter o estado atual evita que o rabinho desapareça.
-  if (currentLast.high > nextLast.high) return true;
-  if (currentLast.low < nextLast.low) return true;
-  return false;
-}
+): boolean {}
 
 function mergeSeedWithLiveTail(
killedBy: live candle helpers keeps a live-updated tail when REST returns the same timestamp
statusReason: expected 'replace' to be 'keep' // Object.is equality

[Killed] ArithmeticOperator
src/features/trade/live-candles.ts:295:31
   current: readonly ChartCandle[],
   nextSeed: readonly ChartCandle[],
 ): boolean {
-  const currentLast = current[current.length - 1];
+  const currentLast = current[current.length + 1];
   const nextLast = nextSeed[nextSeed.length - 1];
   if (!currentLast || !nextLast) return false;
killedBy: live candle helpers keeps a live-updated tail when REST returns the same timestamp
statusReason: expected 'replace' to be 'keep' // Object.is equality

[Killed] ArithmeticOperator
src/features/trade/live-candles.ts:296:29
   nextSeed: readonly ChartCandle[],
 ): boolean {
   const currentLast = current[current.length - 1];
-  const nextLast = nextSeed[nextSeed.length - 1];
+  const nextLast = nextSeed[nextSeed.length + 1];
   if (!currentLast || !nextLast) return false;
   if (nextSeed.length !== current.length) return false;
killedBy: live candle helpers keeps a live-updated tail when REST returns the same timestamp
statusReason: expected 'replace' to be 'keep' // Object.is equality

[Killed] BooleanLiteral
src/features/trade/live-candles.ts:297:7
 ): boolean {
   const currentLast = current[current.length - 1];
   const nextLast = nextSeed[nextSeed.length - 1];
-  if (!currentLast || !nextLast) return false;
+  if (currentLast || !nextLast) return false;
   if (nextSeed.length !== current.length) return false;
   if (nextLast.time !== currentLast.time) return false;
killedBy: live candle helpers keeps a live-updated tail when REST returns the same timestamp
statusReason: expected 'replace' to be 'keep' // Object.is equality

[Killed] BooleanLiteral
src/features/trade/live-candles.ts:297:23
 ): boolean {
   const currentLast = current[current.length - 1];
   const nextLast = nextSeed[nextSeed.length - 1];
-  if (!currentLast || !nextLast) return false;
+  if (!currentLast || nextLast) return false;
   if (nextSeed.length !== current.length) return false;
   if (nextLast.time !== currentLast.time) return false;
killedBy: live candle helpers keeps a live-updated tail when REST returns the same timestamp
statusReason: expected 'replace' to be 'keep' // Object.is equality

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:298:7
   const currentLast = current[current.length - 1];
   const nextLast = nextSeed[nextSeed.length - 1];
   if (!currentLast || !nextLast) return false;
-  if (nextSeed.length !== current.length) return false;
+  if (false) return false;
   if (nextLast.time !== currentLast.time) return false;
   if (currentLast.close !== nextLast.close) return true;
killedBy: live candle helpers keeps current tail candles at the seed boundary and sorts newer tail
statusReason: expected 'keep' to be 'replace' // Object.is equality

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:298:7
   const currentLast = current[current.length - 1];
   const nextLast = nextSeed[nextSeed.length - 1];
   if (!currentLast || !nextLast) return false;
-  if (nextSeed.length !== current.length) return false;
+  if (true) return false;
   if (nextLast.time !== currentLast.time) return false;
   if (currentLast.close !== nextLast.close) return true;
killedBy: live candle helpers keeps a live-updated tail when REST returns the same timestamp
statusReason: expected 'replace' to be 'keep' // Object.is equality

[Killed] EqualityOperator
src/features/trade/live-candles.ts:299:7
   const nextLast = nextSeed[nextSeed.length - 1];
   if (!currentLast || !nextLast) return false;
   if (nextSeed.length !== current.length) return false;
-  if (nextLast.time !== currentLast.time) return false;
+  if (nextLast.time === currentLast.time) return false;
   if (currentLast.close !== nextLast.close) return true;
   // Wick (rabinho) protection: o tick SSE pode ter expandido high/low entre
killedBy: live candle helpers keeps painted closed candles when a stale refetch lands behind live tail
statusReason: expected 'keep' to be 'replace' // Object.is equality

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:299:7
   const nextLast = nextSeed[nextSeed.length - 1];
   if (!currentLast || !nextLast) return false;
   if (nextSeed.length !== current.length) return false;
-  if (nextLast.time !== currentLast.time) return false;
+  if (false) return false;
   if (currentLast.close !== nextLast.close) return true;
   // Wick (rabinho) protection: o tick SSE pode ter expandido high/low entre
killedBy: live candle helpers keeps painted closed candles when a stale refetch lands behind live tail
statusReason: expected 'keep' to be 'replace' // Object.is equality

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:300:7
   if (!currentLast || !nextLast) return false;
   if (nextSeed.length !== current.length) return false;
   if (nextLast.time !== currentLast.time) return false;
-  if (currentLast.close !== nextLast.close) return true;
+  if (false) return true;
   // Wick (rabinho) protection: o tick SSE pode ter expandido high/low entre
   // dois fetches do Matrix. Se o snapshot retorna a mesma vela mas com wick
killedBy: live candle helpers keeps a live-updated close even when the wick did not expand
statusReason: expected 'replace' to be 'keep' // Object.is equality

[Killed] EqualityOperator
src/features/trade/live-candles.ts:300:7
   if (!currentLast || !nextLast) return false;
   if (nextSeed.length !== current.length) return false;
   if (nextLast.time !== currentLast.time) return false;
-  if (currentLast.close !== nextLast.close) return true;
+  if (currentLast.close === nextLast.close) return true;
   // Wick (rabinho) protection: o tick SSE pode ter expandido high/low entre
   // dois fetches do Matrix. Se o snapshot retorna a mesma vela mas com wick
killedBy: live candle helpers keeps a live-updated close even when the wick did not expand
statusReason: expected 'replace' to be 'keep' // Object.is equality

[Killed] BooleanLiteral
src/features/trade/live-candles.ts:304:48
   // Wick (rabinho) protection: o tick SSE pode ter expandido high/low entre
   // dois fetches do Matrix. Se o snapshot retorna a mesma vela mas com wick
   // mais curto, manter o estado atual evita que o rabinho desapareça.
-  if (currentLast.high > nextLast.high) return true;
+  if (currentLast.high > nextLast.high) return false;
   if (currentLast.low < nextLast.low) return true;
   return false;
killedBy: live candle helpers keeps a live-expanded high wick on the same timestamp
statusReason: expected 'replace' to be 'keep' // Object.is equality

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:304:7
   // Wick (rabinho) protection: o tick SSE pode ter expandido high/low entre
   // dois fetches do Matrix. Se o snapshot retorna a mesma vela mas com wick
   // mais curto, manter o estado atual evita que o rabinho desapareça.
-  if (currentLast.high > nextLast.high) return true;
+  if (false) return true;
   if (currentLast.low < nextLast.low) return true;
   return false;
killedBy: live candle helpers keeps a live-expanded high wick on the same timestamp
statusReason: expected 'replace' to be 'keep' // Object.is equality

[Killed] EqualityOperator
src/features/trade/live-candles.ts:305:7
   // dois fetches do Matrix. Se o snapshot retorna a mesma vela mas com wick
   // mais curto, manter o estado atual evita que o rabinho desapareça.
   if (currentLast.high > nextLast.high) return true;
-  if (currentLast.low < nextLast.low) return true;
+  if (currentLast.low <= nextLast.low) return true;
   return false;
 }
killedBy: live candle helpers lets same-tail refetches update older closed candles
statusReason: expected 'keep' to be 'replace' // Object.is equality

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:305:7
   // dois fetches do Matrix. Se o snapshot retorna a mesma vela mas com wick
   // mais curto, manter o estado atual evita que o rabinho desapareça.
   if (currentLast.high > nextLast.high) return true;
-  if (currentLast.low < nextLast.low) return true;
+  if (false) return true;
   return false;
 }
killedBy: live candle helpers keeps a live-expanded low wick on the same timestamp
statusReason: expected 'replace' to be 'keep' // Object.is equality

[Killed] BooleanLiteral
src/features/trade/live-candles.ts:306:10
   // mais curto, manter o estado atual evita que o rabinho desapareça.
   if (currentLast.high > nextLast.high) return true;
   if (currentLast.low < nextLast.low) return true;
-  return false;
+  return true;
 }
 
killedBy: live candle helpers lets same-tail refetches update older closed candles
statusReason: expected 'keep' to be 'replace' // Object.is equality

[Killed] ArithmeticOperator
src/features/trade/live-candles.ts:314:29
   nextSeed: readonly ChartCandle[],
   maxCandles: number,
 ): ChartCandle[] | null {
-  const nextLast = nextSeed[nextSeed.length - 1];
+  const nextLast = nextSeed[nextSeed.length + 1];
   const currentLast = current[current.length - 1];
   if (!nextLast) return null;
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] ArithmeticOperator
src/features/trade/live-candles.ts:315:31
   maxCandles: number,
 ): ChartCandle[] | null {
   const nextLast = nextSeed[nextSeed.length - 1];
-  const currentLast = current[current.length - 1];
+  const currentLast = current[current.length + 1];
   if (!nextLast) return null;
   // Issue #187: once SSE has advanced beyond a REST seed, a later stale
killedBy: live candle helpers keeps painted closed candles when a stale refetch lands behind live tail
statusReason: expected { time: 1700001720, open: 127.8, …(4) } to match object { close: 128 }
(5 matching properties omitted from actual)

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:316:7
 ): ChartCandle[] | null {
   const nextLast = nextSeed[nextSeed.length - 1];
   const currentLast = current[current.length - 1];
-  if (!nextLast) return null;
+  if (true) return null;
   // Issue #187: once SSE has advanced beyond a REST seed, a later stale
   // refetch must not rewrite already-painted closed candles behind that tail.
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] BooleanLiteral
src/features/trade/live-candles.ts:316:7
 ): ChartCandle[] | null {
   const nextLast = nextSeed[nextSeed.length - 1];
   const currentLast = current[current.length - 1];
-  if (!nextLast) return null;
+  if (nextLast) return null;
   // Issue #187: once SSE has advanced beyond a REST seed, a later stale
   // refetch must not rewrite already-painted closed candles behind that tail.
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] EqualityOperator
src/features/trade/live-candles.ts:320:20
   // Issue #187: once SSE has advanced beyond a REST seed, a later stale
   // refetch must not rewrite already-painted closed candles behind that tail.
   const preserveFromTime =
-    currentLast && currentLast.time > nextLast.time
+    currentLast && currentLast.time >= nextLast.time
       ? nextSeed[0]?.time
       : nextLast.time;
killedBy: live candle helpers lets same-tail refetches update older closed candles
statusReason: expected { time: 1700000220, open: 102.8, …(4) } to match object { close: 444 }
(5 matching properties omitted from actual)

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:320:20
   // Issue #187: once SSE has advanced beyond a REST seed, a later stale
   // refetch must not rewrite already-painted closed candles behind that tail.
   const preserveFromTime =
-    currentLast && currentLast.time > nextLast.time
+    currentLast && true
       ? nextSeed[0]?.time
       : nextLast.time;
killedBy: live candle helpers lets same-tail refetches update older closed candles
statusReason: expected { time: 1700000220, open: 102.8, …(4) } to match object { close: 444 }
(5 matching properties omitted from actual)

[Survived] OptionalChaining
src/features/trade/live-candles.ts:321:9
   // refetch must not rewrite already-painted closed candles behind that tail.
   const preserveFromTime =
     currentLast && currentLast.time > nextLast.time
-      ? nextSeed[0]?.time
+      ? nextSeed[0].time
       : nextLast.time;
   if (preserveFromTime === undefined) return null;

[Killed] EqualityOperator
src/features/trade/live-candles.ts:323:7
     currentLast && currentLast.time > nextLast.time
       ? nextSeed[0]?.time
       : nextLast.time;
-  if (preserveFromTime === undefined) return null;
+  if (preserveFromTime !== undefined) return null;
   const byTime = new Map<number, ChartCandle>();
   for (const candle of nextSeed) byTime.set(candle.time, { ...candle });
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:323:7
     currentLast && currentLast.time > nextLast.time
       ? nextSeed[0]?.time
       : nextLast.time;
-  if (preserveFromTime === undefined) return null;
+  if (true) return null;
   const byTime = new Map<number, ChartCandle>();
   for (const candle of nextSeed) byTime.set(candle.time, { ...candle });
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] ObjectLiteral
src/features/trade/live-candles.ts:325:58
       : nextLast.time;
   if (preserveFromTime === undefined) return null;
   const byTime = new Map<number, ChartCandle>();
-  for (const candle of nextSeed) byTime.set(candle.time, { ...candle });
+  for (const candle of nextSeed) byTime.set(candle.time, {});
   let changed = false;
   for (const candle of current) {
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected undefined to be 1700001780 // Object.is equality

[Survived] BooleanLiteral
src/features/trade/live-candles.ts:326:17
   if (preserveFromTime === undefined) return null;
   const byTime = new Map<number, ChartCandle>();
   for (const candle of nextSeed) byTime.set(candle.time, { ...candle });
-  let changed = false;
+  let changed = true;
   for (const candle of current) {
     if (candle.time < preserveFromTime) continue;

[Killed] BlockStatement
src/features/trade/live-candles.ts:327:33
   const byTime = new Map<number, ChartCandle>();
   for (const candle of nextSeed) byTime.set(candle.time, { ...candle });
   let changed = false;
-  for (const candle of current) {
-    if (candle.time < preserveFromTime) continue;
-    const existing = byTime.get(candle.time);
-    if (existing && sameLiveCandle(existing, candle)) continue;
-    byTime.set(candle.time, { ...candle });
-    changed = true;
-  }
+  for (const candle of current) {}
   if (!changed) return null;
   return capLiveCandles(
killedBy: live candle helpers merges a late REST seed without dropping the current live candle
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001840, close: 140 }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/features/trade/live-candles.ts:328:9
   for (const candle of nextSeed) byTime.set(candle.time, { ...candle });
   let changed = false;
   for (const candle of current) {
-    if (candle.time < preserveFromTime) continue;
+    if (false) continue;
     const existing = byTime.get(candle.time);
     if (existing && sameLiveCandle(existing, candle)) continue;
killedBy: live candle helpers drops current candles older than a stale refetch window
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/features/trade/live-candles.ts:328:9
   for (const candle of nextSeed) byTime.set(candle.time, { ...candle });
   let changed = false;
   for (const candle of current) {
-    if (candle.time < preserveFromTime) continue;
+    if (candle.time <= preserveFromTime) continue;
     const existing = byTime.get(candle.time);
     if (existing && sameLiveCandle(existing, candle)) continue;
killedBy: live candle helpers keeps current tail candles at the seed boundary and sorts newer tail
statusReason: expected { time: 1700001780, open: 128.8, …(4) } to match object { time: 1700001780, close: 177 }
(4 matching properties omitted from actual)

[Killed] MethodExpression
src/features/trade/live-candles.ts:336:5
   }
   if (!changed) return null;
   return capLiveCandles(
-    [...byTime.values()].sort((a, b) => a.time - b.time),
+    [...byTime.values()],
     maxCandles,
   );
killedBy: live candle helpers keeps current tail candles at the seed boundary and sorts newer tail
statusReason: expected 1700001900 to be 1700001840 // Object.is equality
