[Killed] OptionalChaining
src/components/trade/TradeCardMiniChart.tsx:120:25
     [props.candles, maxCandles],
   );
   const isCompleteData = hasCompleteMiniChartData(data, minimumCandles);
-  const firstDataTime = data[0]?.time;
+  const firstDataTime = data[0].time;
   const lastDataTime = data[data.length - 1]?.time;
   const lastDataClose = data[data.length - 1]?.close;
killedBy: TradeCardMiniChart property invariants setData is never called with non-empty length below minimumCandles across 200 random inputs
statusReason: Cannot read properties of undefined (reading 'time')

[Killed] ArithmeticOperator
src/components/trade/TradeCardMiniChart.tsx:121:29
   );
   const isCompleteData = hasCompleteMiniChartData(data, minimumCandles);
   const firstDataTime = data[0]?.time;
-  const lastDataTime = data[data.length - 1]?.time;
+  const lastDataTime = data[data.length + 1]?.time;
   const lastDataClose = data[data.length - 1]?.close;
   const closedCandleSignature = closedMiniCandleSignature(data);
killedBy: TradeCardMiniChart telemetry attributes keeps the legacy active-card window at 30 rendered and 15 visible candles
statusReason: expect(element).toHaveAttribute("data-last-candle-time", "1777283040") // element.getAttribute("data-last-candle-time") === "1777283040"

Expected the element to have attribute:
  data-last-candle-time="1777283040"
Received:
  data-last-candle-time=""

[Killed] OptionalChaining
src/components/trade/TradeCardMiniChart.tsx:121:24
   );
   const isCompleteData = hasCompleteMiniChartData(data, minimumCandles);
   const firstDataTime = data[0]?.time;
-  const lastDataTime = data[data.length - 1]?.time;
+  const lastDataTime = data[data.length - 1].time;
   const lastDataClose = data[data.length - 1]?.close;
   const closedCandleSignature = closedMiniCandleSignature(data);
killedBy: TradeCardMiniChart property invariants setData is never called with non-empty length below minimumCandles across 200 random inputs
statusReason: Cannot read properties of undefined (reading 'time')

[Killed] OptionalChaining
src/components/trade/TradeCardMiniChart.tsx:122:25
   const isCompleteData = hasCompleteMiniChartData(data, minimumCandles);
   const firstDataTime = data[0]?.time;
   const lastDataTime = data[data.length - 1]?.time;
-  const lastDataClose = data[data.length - 1]?.close;
+  const lastDataClose = data[data.length - 1].close;
   const closedCandleSignature = closedMiniCandleSignature(data);
   const hasPaintedSnapshot =
killedBy: TradeCardMiniChart property invariants setData is never called with non-empty length below minimumCandles across 200 random inputs
statusReason: Cannot read properties of undefined (reading 'close')

[Killed] ArithmeticOperator
src/components/trade/TradeCardMiniChart.tsx:122:30
   const isCompleteData = hasCompleteMiniChartData(data, minimumCandles);
   const firstDataTime = data[0]?.time;
   const lastDataTime = data[data.length - 1]?.time;
-  const lastDataClose = data[data.length - 1]?.close;
+  const lastDataClose = data[data.length + 1]?.close;
   const closedCandleSignature = closedMiniCandleSignature(data);
   const hasPaintedSnapshot =
killedBy: TradeCardMiniChart telemetry attributes keeps the legacy active-card window at 30 rendered and 15 visible candles
statusReason: expect(element).toHaveAttribute("data-last-candle-close", "64308") // element.getAttribute("data-last-candle-close") === "64308"

Expected the element to have attribute:
  data-last-candle-close="64308"
Received:
  data-last-candle-close=""

[Killed] ConditionalExpression
src/components/trade/TradeCardMiniChart.tsx:188:30
       data-first-candle-time={
         firstDataTime == null ? "" : String(firstDataTime)
       }
-      data-last-candle-time={lastDataTime == null ? "" : String(lastDataTime)}
+      data-last-candle-time={true ? "" : String(lastDataTime)}
       data-last-candle-close={
         lastDataClose == null ? "" : String(lastDataClose)
killedBy: TradeCardMiniChart telemetry attributes keeps the legacy active-card window at 30 rendered and 15 visible candles
statusReason: expect(element).toHaveAttribute("data-last-candle-time", "1777283040") // element.getAttribute("data-last-candle-time") === "1777283040"

Expected the element to have attribute:
  data-last-candle-time="1777283040"
Received:
  data-last-candle-time=""

[Killed] EqualityOperator
src/components/trade/TradeCardMiniChart.tsx:188:30
       data-first-candle-time={
         firstDataTime == null ? "" : String(firstDataTime)
       }
-      data-last-candle-time={lastDataTime == null ? "" : String(lastDataTime)}
+      data-last-candle-time={lastDataTime != null ? "" : String(lastDataTime)}
       data-last-candle-close={
         lastDataClose == null ? "" : String(lastDataClose)
killedBy: TradeCardMiniChart telemetry attributes keeps the legacy active-card window at 30 rendered and 15 visible candles
statusReason: expect(element).toHaveAttribute("data-last-candle-time", "1777283040") // element.getAttribute("data-last-candle-time") === "1777283040"

Expected the element to have attribute:
  data-last-candle-time="1777283040"
Received:
  data-last-candle-time=""

[Killed] MethodExpression
src/components/trade/TradeCardMiniChart.tsx:264:10
 function closedMiniCandleSignature(
   data: readonly CandlestickData[],
 ): string {
-  return data
-    .slice(0, -1)
+  return data
     .map((candle) =>
       [
killedBy: TradeCardMiniChart telemetry attributes keeps the legacy active-card window at 30 rendered and 15 visible candles
statusReason: expected '1777281300:64097:64117:64090:64105|17…' not to contain '1777283040'

[Killed] UnaryOperator
src/components/trade/TradeCardMiniChart.tsx:265:15
   data: readonly CandlestickData[],
 ): string {
   return data
-    .slice(0, -1)
+    .slice(0, +1)
     .map((candle) =>
       [
killedBy: TradeCardMiniChart telemetry attributes keeps the legacy active-card window at 30 rendered and 15 visible candles
statusReason: expected '1777281300:64097:64117:64090:64105' to contain '1777282980'

[Killed] ArrowFunction
src/components/trade/TradeCardMiniChart.tsx:266:10
 ): string {
   return data
     .slice(0, -1)
-    .map((candle) =>
-      [
-        String(candle.time),
-        candle.open,
-        candle.high,
-        candle.low,
-        candle.close,
-      ].join(":"),
+    .map(() => undefined,
     )
     .join("|");
killedBy: TradeCardMiniChart telemetry attributes keeps the legacy active-card window at 30 rendered and 15 visible candles
statusReason: expected '||||||||||||||||||||||||||||' to contain '1777282980'

[Killed] ArrayDeclaration
src/components/trade/TradeCardMiniChart.tsx:267:7
   return data
     .slice(0, -1)
     .map((candle) =>
-      [
-        String(candle.time),
-        candle.open,
-        candle.high,
-        candle.low,
-        candle.close,
-      ].join(":"),
+      [].join(":"),
     )
     .join("|");
killedBy: TradeCardMiniChart telemetry attributes keeps the legacy active-card window at 30 rendered and 15 visible candles
statusReason: expected '||||||||||||||||||||||||||||' to contain '1777282980'
